Repository: MLGRussianXP/python-docs-ru
Catalog: tutorial/datastructures.po
Languages: ru

source: Data Structures
ru: Структуры данных

source: This chapter describes some things you've learned about already in more detail, and adds some new things as well.
ru: Данная глава описывает некоторые вещи, которые вы уже изучили, более детально, и добавляет кое-что новое.

source: More on Lists
ru: Подробнее о списках

source: The list data type has some more methods. Here are all of the methods of list objects:
ru: Тип данных список имеет несколько больше методов. Здесь перечислены все методы объекта список:

source: Add an item to the end of the list. Equivalent to ``a[len(a):] = [x]``.
ru: Добавление элемента в конец списка. Эквивалентно ``a[len(a):] = [x]``.

source: Extend the list by appending all the items from the iterable. Equivalent to ``a[len(a):] = iterable``.
ru: Расширение списка добавление всех элементов итерируемого объекта. Эквивалентно ``a[len(a):] = iterable``.

source: Insert an item at a given position. The first argument is the index of the element before which to insert, so ``a.insert(0, x)`` inserts at the front of the list, and ``a.insert(len(a), x)`` is equivalent to ``a.append(x)``.
ru: Вставка элемента на определенную позицию. Первый аргумент это индекс элемента, перед которым происходит вставка, таким образом ``a.insert(0, x)`` поместит элемент в начало списка, а ``a.insert(len(a), x)`` эквивалентно ``a.append(x)``.

source: Remove the first item from the list whose value is equal to *x*. It raises a :exc:`ValueError` if there is no such item.
ru: Удаление первого элемента списка, чье значение равно *x*. Возбуждает :exc:`ValueError` если такого элемента нет.

source: Remove all items from the list. Equivalent to ``del a[:]``.
ru: Удаление всех элементов списка. Эквивалентно ``del a[:]``.

source: Return zero-based index in the list of the first item whose value is equal to *x*. Raises a :exc:`ValueError` if there is no such item.
ru: Возвращает отсчитываемый от нуля индекс первого элемента списка, чье значение равно *x*. Возбуждает :exc:`ValueError` если такого элемента нет.

source: The optional arguments *start* and *end* are interpreted as in the slice notation and are used to limit the search to a particular subsequence of the list. The returned index is computed relative to the beginning of the full sequence rather than the *start* argument.
ru: Необязательные аргументы *start* и *end* интерпретируются как в обозначении среза и используются чтобы ограничить поиск конкретной подпоследовательностью списка. Возвращаемый индекс рассчитывается относительно начала полной последовательности, а не аргумента *start*.

source: Return the number of times *x* appears in the list.
ru: Возвращает количество раз, которое *x* появляется в списке.

source: Sort the items of the list in place (the arguments can be used for sort customization, see :func:`sorted` for their explanation).
ru: Сортировка элементов списка на месте (аргументы могут использоваться для настройки сортировки, смотри :func:`sorted` для их пояснения).

source: Reverse the elements of the list in place.
ru: Переворачивает элементы списка на месте.

source: Return a shallow copy of the list. Equivalent to ``a[:]``.
ru: Возвращает уменьшенную копию списка. Эквивалентно ``a[:]``.

source: An example that uses most of the list methods::
ru: Пример, который использует большиство методов списка::

source: You might have noticed that methods like ``insert``, ``remove`` or ``sort`` that only modify the list have no return value printed -- they return the default ``None``. [#]_ This is a design principle for all mutable data structures in Python.
ru: Вы могли заметить, что методы, как ``insert``, ``remove`` или ``sort``, которые только изменяют список, не возвращают значений на экран - они возвращают значение по умолчанию ``None``. [#]_ Это принцип работы для всех изменяемых структур данных в Python.

source: Another thing you might notice is that not all data can be sorted or compared. For instance, ``[None, 'hello', 10]`` doesn't sort because integers can't be compared to strings and *None* can't be compared to other types. Also, there are some types that don't have a defined ordering relation. For example, ``3+4j < 5+7j`` isn't a valid comparison.
ru: Другое, что вы можете заметить, это то, что не все данные могут быть отсортированы или сравнены. Например, ``[None, 'hello', 10]`` не сортируется, потому что целые числа не могут быть сравнены со строками, а *None* не может быть сравнен с другими типами. Также есть некоторые типы, у которых нет определенного порядка. Например, ``3+4j < 5+7j`` не является верным сравнением.

source: Using Lists as Stacks
ru: Использование списка в качестве стека

source: The list methods make it very easy to use a list as a stack, where the last element added is the first element retrieved ("last-in, first-out"). To add an item to the top of the stack, use :meth:`~list.append`. To retrieve an item from the top of the stack, use :meth:`~list.pop` without an explicit index. For example::
ru: Методы списка делают очень простым использование списка как стека, где добавленный последний элемент это первый запрашиваемый элемент ("последним пришел, первым ушел"). Для добавления элемента в стек используйте :meth:`~list.append`. Чтобы получить элемент с вершины стека, используйте :meth:`~list.pop` без явного указания индекса. Например::

source: Using Lists as Queues
ru: Использование списка в качестве очереди

source: It is also possible to use a list as a queue, where the first element added is the first element retrieved ("first-in, first-out"); however, lists are not efficient for this purpose. While appends and pops from the end of list are fast, doing inserts or pops from the beginning of a list is slow (because all of the other elements have to be shifted by one).
ru: Также возможно использование списка как очереди, где первый элемент добавленный - это первый элемент запрашиваемый ("первый пришел, первый ушел"); однако, списки неэффективны для таких целей. Хотя добавление и получение элементов с конца списка быстрое, добавление или извлечение из начала списка является медленным (потому что все остальные элементы должны быть сдвинуты на один).

source: To implement a queue, use :class:`collections.deque` which was designed to have fast appends and pops from both ends. For example::
ru: Для реализации очереди, используйте :class:`collections.deque`, который создан для быстрого добавления и извлечения элементов с обоих концов. Например::

source: List Comprehensions
ru: Компоновка списка

source: List comprehensions provide a concise way to create lists. Common applications are to make new lists where each element is the result of some operations applied to each member of another sequence or iterable, or to create a subsequence of those elements that satisfy a certain condition.
ru: Компоновка списков предусматривает компактный способ создания списков. Общее применение это создать новый список, где каждый элемент является результатом некоторых операций, примененных к каждому члену другой последовательности или итерируемого объекта, или создать подпоследовательность этих элементов, которые удовлетворяют определенному условию.

source: For example, assume we want to create a list of squares, like::
ru: Например, предположим, мы хотим создать список из квадратов элементов, как::

source: Note that this creates (or overwrites) a variable named ``x`` that still exists after the loop completes. We can calculate the list of squares without any side effects using::
ru: Обратите внимание, что создается (или перезаписывается) переменная ``x``, которая продолжает существовать после того, как цикл завершится. Мы можем рассчитать список квадратов без каких-либо побочных эффектов, используя::

source: or, equivalently::
ru: или, эквивалентно::

source: which is more concise and readable.
ru: что выглядит более лаконично и читабельно.

source: A list comprehension consists of brackets containing an expression followed by a :keyword:`!for` clause, then zero or more :keyword:`!for` or :keyword:`!if` clauses. The result will be a new list resulting from evaluating the expression in the context of the :keyword:`!for` and :keyword:`!if` clauses which follow it. For example, this listcomp combines the elements of two lists if they are not equal::
ru: Списковое включение состоит из скобок, содержащих выражение, за которым следует фраза :keyword:`!for`, затем ноль или более фраз :keyword:`!for` или :keyword:`!if`. Результатом будет новый список, полученный вычислением выражения в контексте фраз :keyword:`!for` и :keyword:`!if`, следующих за ним. Например, это списковое включение комбинирует элементы из двух списков, если они не равны::

source: and it's equivalent to::
ru: и это эквивалетно::

source: Note how the order of the :keyword:`for` and :keyword:`if` statements is the same in both these snippets.
ru: Обратите внимание, что порядок ключевых слов :keyword:`for` и :keyword:`if` выражения одинаковый для обоих фрагментов.

source: If the expression is a tuple (e.g. the ``(x, y)`` in the previous example), it must be parenthesized. ::
ru: Если выражение является кортежем (то есть ``(x, y)``, как в предыдущем примере), оно должно заключаться в скобки. ::

source: List comprehensions can contain complex expressions and nested functions::
ru: Компоновка списка может содержать сложные выражения и вложенные функции::

source: Nested List Comprehensions
ru: Компоновка вложенных списков

source: The initial expression in a list comprehension can be any arbitrary expression, including another list comprehension.
ru: Исходным выражением компоновки может быть любое произвольное выражение, включая другое списочное включение.

source: Consider the following example of a 3x4 matrix implemented as a list of 3 lists of length 4::
ru: Рассмотрим следующий пример матрицы 3x4, реализованной в виде списка из 3 списков длины 4::

source: The following list comprehension will transpose rows and columns::
ru: Следующая компоновка списка транспонирует ряды и столбцы::

source: As we saw in the previous section, the inner list comprehension is evaluated in the context of the :keyword:`for` that follows it, so this example is equivalent to::
ru: Как мы видели в предыдущей секции, вложенное списковое включение вычисляется для содержимого :keyword:`for`, которое за ним следует, и это эквивалентно::

source: which, in turn, is the same as::
ru: что, в свою очередь, тоже самое, что::

source: In the real world, you should prefer built-in functions to complex flow statements. The :func:`zip` function would do a great job for this use case::
ru: В реальном мире вы должны предпочесть встроенные функции сложным операторам потока. Функция :func:`zip` отлично подойдет для этого случая использования::

source: See :ref:`tut-unpacking-arguments` for details on the asterisk in this line.
ru: Смотри :ref:`tut-unpacking-arguments` для информации о сноске в этой строке.

source: The :keyword:`!del` statement
ru: Инструкция :keyword:`!del`

source: There is a way to remove an item from a list given its index instead of its value: the :keyword:`del` statement. This differs from the :meth:`~list.pop` method which returns a value. The :keyword:`!del` statement can also be used to remove slices from a list or clear the entire list (which we did earlier by assignment of an empty list to the slice). For example::
ru: Есть способ удалить элемент из списка по его индексу вместо значения: инструкция :keyword:`del`. Это отличается от метода :meth:`~list.pop`, который возвращает значение. Инструкция :keyword:`!del` также может использоваться для удаления срезов из списка или очистки всего списка (что мы сделали ранее, присвоив пустой список срезу). Например::

source: :keyword:`del` can also be used to delete entire variables::
ru: :keyword:`del` может также быть использовано для удаления целых переменных::

source: Referencing the name ``a`` hereafter is an error (at least until another value is assigned to it). We'll find other uses for :keyword:`del` later.
ru: Ссылка на имя ``a`` в дальнейшем это ошибка (по крайней мере, пока ему не будет присвоено другое значение). Мы найдем другие примеры использования :keyword:`del` позже.

source: Tuples and Sequences
ru: Кортежи и последовательности

source: We saw that lists and strings have many common properties, such as indexing and slicing operations. They are two examples of *sequence* data types (see :ref:`typesseq`). Since Python is an evolving language, other sequence data types may be added. There is also another standard sequence data type: the *tuple*.
ru: Мы видим, что списки и строки имеют много общих свойств, таких как индексирование и срезы. Они представляют собой примеры типов данных *последовательности* (смотри :ref:`typesseq`). Поскольку Python является развивающимся языком, могут быть добавлены другие типы данных последовательности. Существует также еще один стандартный тип данных последовательности: *кортеж*.

source: A tuple consists of a number of values separated by commas, for instance::
ru: Кортеж состоит из числа переменных, разделенных запятой, например::

source: As you see, on output tuples are always enclosed in parentheses, so that nested tuples are interpreted correctly; they may be input with or without surrounding parentheses, although often parentheses are necessary anyway (if the tuple is part of a larger expression). It is not possible to assign to the individual items of a tuple, however it is possible to create tuples which contain mutable objects, such as lists.
ru: Как видите, выходящий кортеж всегда заключен в скобки, поэтому вложенные кортежи интерпретируются правильно; они могут быть введены с или без окружающих скобок, хотя обычно скобки необходимы так или иначе (если кортеж является частью большого выражения). Невозможно присвоить отдельный элемент кортежа, однако возможно создавать кортежи, содержащие изменяемые объекты, как списки.

source: Though tuples may seem similar to lists, they are often used in different situations and for different purposes. Tuples are :term:`immutable`, and usually contain a heterogeneous sequence of elements that are accessed via unpacking (see later in this section) or indexing (or even by attribute in the case of :func:`namedtuples <collections.namedtuple>`). Lists are :term:`mutable`, and their elements are usually homogeneous and are accessed by iterating over the list.
ru: Хотя кортежи могут выглядеть похожими на списки, они часто используются в других ситуациях и для других целей. Кортежи :term:`immutable`, и обычно содержат гетерогенную последовательность элементов, которая доступна через распаковку(смотри дальше в этой секции) или индексацию (или даже через аттрибут в случае :func:`namedtuples <collections.namedtuple>`). Списки :term:`mutable`, и их лементы обычно гомогенные и доступны через итерирование по списку.

source: A special problem is the construction of tuples containing 0 or 1 items: the syntax has some extra quirks to accommodate these. Empty tuples are constructed by an empty pair of parentheses; a tuple with one item is constructed by following a value with a comma (it is not sufficient to enclose a single value in parentheses). Ugly, but effective. For example::
ru: Особой проблемой является построение кортежей, содержащих 0 или 1 элемент: синтаксис имеет некоторые дополнительные причуды, к которым нужно привыкнуть. Пустые кортежи строятся пустой парой скобок; кортеж с одним элементом строится, следуя за значением с запятой (недостаточно заключить одно значение в скобки). Некрасиво, но эффективно. Например::

source: The statement ``t = 12345, 54321, 'hello!'`` is an example of *tuple packing*: the values ``12345``, ``54321`` and ``'hello!'`` are packed together in a tuple. The reverse operation is also possible::
ru: Выражение ``t = 12345, 54321, 'hello!'`` это пример *запаковки кортежа*: значения ``12345``, ``54321`` and ``'hello!'`` упакованы в кортеж. Обратная операция тоже возможна::

source: This is called, appropriately enough, *sequence unpacking* and works for any sequence on the right-hand side. Sequence unpacking requires that there are as many variables on the left side of the equals sign as there are elements in the sequence. Note that multiple assignment is really just a combination of tuple packing and sequence unpacking.
ru: Это называется, соответственно, *распаковкой последовательности* и работает для любой последовательности с правой стороны. Распаковка последовательности требует, чтобы в левой части знака равенства было столько переменных, сколько элементов в последовательности. Обратите внимание, что множественное назначение - это просто комбинация упаковки кортежей и распаковки последовательности.

source: Sets
ru: Множества

source: Python also includes a data type for *sets*. A set is an unordered collection with no duplicate elements. Basic uses include membership testing and eliminating duplicate entries. Set objects also support mathematical operations like union, intersection, difference, and symmetric difference.
ru: Python также содержит тип данных для *множеств*. Множество это неупорядоченная коллекция без повторяющихся элементов. Основные виды использования включают тестирование членства и устранение дубликатов записей. Объекты множеств также поддерживают математические операции, такие как объединение, пересечение, разность и симметричная разность.

source: Curly braces or the :func:`set` function can be used to create sets. Note: to create an empty set you have to use ``set()``, not ``{}``; the latter creates an empty dictionary, a data structure that we discuss in the next section.
ru: Для создания множества могут быть использованы фигурные скобки или функция :func:`set`. Примечание: чтобы создать пустой набор, вы должны использовать ``set()``, а не ``{}``; последний создает пустой словарь, структуру данных, которую мы обсудим в следующем разделе.

source: Here is a brief demonstration::
ru: Вот краткая демонстрация::

source: Similarly to :ref:`list comprehensions <tut-listcomps>`, set comprehensions are also supported::
ru: Аналогично с компоновкой списка :ref:`list comprehensions <tut-listcomps>`, компоновка множеств также поддерживается::

source: Dictionaries
ru: Словари

source: Another useful data type built into Python is the *dictionary* (see :ref:`typesmapping`). Dictionaries are sometimes found in other languages as "associative memories" or "associative arrays". Unlike sequences, which are indexed by a range of numbers, dictionaries are indexed by *keys*, which can be any immutable type; strings and numbers can always be keys. Tuples can be used as keys if they contain only strings, numbers, or tuples; if a tuple contains any mutable object either directly or indirectly, it cannot be used as a key. You can't use lists as keys, since lists can be modified in place using index assignments, slice assignments, or methods like :meth:`~list.append` and :meth:`~list.extend`.
ru: Другой полезной структурой данных, встроенной в Python, являются *словари* (см. :ref:`typesmapping`). В других языках словари иногда можно встретить как "ассоциативную память" или "ассоциативные массивы". В отличие от последовательностей, которые индексированы диапазоном чисел, словари индексируются по *ключам*, которыми могут быть любые неизменяемые типы; строки и числа всегда могут быть ключами. Кортежи могут быть ключами, только если они содержат только строки, числа или кортежи; если кортеж содержит любой изменяемый объект прямо или косвенно, он не может использоваться как ключ. Вы не можете использовать списки в качестве ключей, так как списки могут быть изменены на месте с помощью присваиваний индексов, присваиваний срезов или таких методов, как :meth:`~list.append` и :meth:`~list.extend`.

source: It is best to think of a dictionary as a set of *key: value* pairs, with the requirement that the keys are unique (within one dictionary). A pair of braces creates an empty dictionary: ``{}``. Placing a comma-separated list of key:value pairs within the braces adds initial key:value pairs to the dictionary; this is also the way dictionaries are written on output.
ru: Лучше всего рассматривать словарь как неупорядоченное множество пар *ключ: значение*, с требованием, чтобы ключи были уникальными (внутри одного словаря). Пара скобок создает пустой словарь: ``{}``. Размещение разделенного запятыми списка пар ключ:значение в фигурных скобках добавляет в словарь начальные пары ключ:значение; это также способ отображения словарей на выходе.

source: The main operations on a dictionary are storing a value with some key and extracting the value given the key. It is also possible to delete a key:value pair with ``del``. If you store using a key that is already in use, the old value associated with that key is forgotten. It is an error to extract a value using a non-existent key.
ru: Основные операции над словарями - это хранение значений с некоторым ключем и извлечение значения по заданному ключу. Также возможно удалить пару ключ:значение с помощью ``del``. Если вы сохраняете значение, используя уже существующий ключ, старое значение, связанное с этим ключом, будет заменено новым. Использование несуществующего ключа приведет к ошибке.

source: Performing ``list(d)`` on a dictionary returns a list of all the keys used in the dictionary, in insertion order (if you want it sorted, just use ``sorted(d)`` instead). To check whether a single key is in the dictionary, use the :keyword:`in` keyword.
ru: Выполнение ``list(d)`` на словаре возвращает список всех ключей, используемых в словаре, в порядке добавления (если вы хотите его отсортировать, просто используйте ``sorted(d)``). Чтобы проверить, находится ли конкретный ключ в словаре, используйте ключевое слово :keyword:`in`.

source: Here is a small example using a dictionary::
ru: Вот небольшой пример использования словаря::

source: The :func:`dict` constructor builds dictionaries directly from sequences of key-value pairs::
ru: Конструктор :func:`dict` построит словарь прямо из последовательности пар ключ-значение::

source: In addition, dict comprehensions can be used to create dictionaries from arbitrary key and value expressions::
ru: В дополнение, для создания словарей может быть использована компоновка, используя произвольные ключ и значение в выражении::

source: When the keys are simple strings, it is sometimes easier to specify pairs using keyword arguments::
ru: Когда ключи являются обычными строками, иногда проще обозначить пары используя ключевые аргументы::

source: Looping Techniques
ru: Техники зацикливания

source: When looping through dictionaries, the key and corresponding value can be retrieved at the same time using the :meth:`~dict.items` method. ::
ru: При циклическом просмотре словарей ключ и соответствующее значение могут быть получены одновременно с помощью метода :meth:`~dict.items`. ::

source: When looping through a sequence, the position index and corresponding value can be retrieved at the same time using the :func:`enumerate` function. ::
ru: При циклическом прохождении последовательности индекс позиции и соответствующее значение могут быть получены одновременно с помощью функции :func:`enumerate` function. ::

source: To loop over two or more sequences at the same time, the entries can be paired with the :func:`zip` function. ::
ru: Для перебора двух или более последовательностей одновременно, записи могут быть сопоставлены с помощью функции :func:`zip`. ::

source: To loop over a sequence in reverse, first specify the sequence in a forward direction and then call the :func:`reversed` function. ::
ru: Для перебора последовательности в обратном порядке сначала укажите последовательность в прямом направлении, а затем вызовите функцию :func:`reversed`. ::
