Repository: MLGRussianXP/python-docs-ru
Catalog: tutorial/datastructures.po
Languages: ru

source: To loop over a sequence in sorted order, use the :func:`sorted` function which returns a new sorted list while leaving the source unaltered. ::
ru: Для перебора последовательности в отсортированном порядке используйте функцию :func:`sorted`, которая возвращает новый отсортированный список, оставляя исходную последовательность неизменной. ::

source: Using :func:`set` on a sequence eliminates duplicate elements. The use of :func:`sorted` in combination with :func:`set` over a sequence is an idiomatic way to loop over unique elements of the sequence in sorted order. ::
ru: Использование :func:`set` в последовательности удаляет повторяющиеся элементы. Использование :func:`sorted` в сочетании с :func:`set` над последовательностью является идиоматическим способом обхода уникальных элементов последовательности в отсортированном порядке. ::

source: It is sometimes tempting to change a list while you are looping over it; however, it is often simpler and safer to create a new list instead. ::
ru: Иногда хочется изменить список во время его обхода; однако часто проще и безопаснее вместо этого создать новый список. ::

source: More on Conditions
ru: Больше о условиях

source: The conditions used in ``while`` and ``if`` statements can contain any operators, not just comparisons.
ru: Условия, используемые в инструкциях ``while`` и ``if``, могут содержать любые операторы, а не только сравнения.

source: The comparison operators ``in`` and ``not in`` are membership tests that determine whether a value is in (or not in) a container. The operators ``is`` and ``is not`` compare whether two objects are really the same object. All comparison operators have the same priority, which is lower than that of all numerical operators.
ru: Операторы сравнения ``in`` и ``not in`` являются проверками принадлежности, которые определяют, находится ли значение в (или не в) контейнере. Операторы ``is`` и ``is not`` сравнивают, являются ли два объекта действительно одним и тем же объектом. Все операторы сравнения имеют одинаковый приоритет, который ниже, чем у всех числовых операторов.

source: Comparisons can be chained. For example, ``a < b == c`` tests whether ``a`` is less than ``b`` and moreover ``b`` equals ``c``.
ru: Сравнения можно объединять в цепочки. Например, ``a < b == c`` проверяет, является ли ``a`` меньше ``b`` и, кроме того, равно ли ``b`` ``c``.

source: Comparisons may be combined using the Boolean operators ``and`` and ``or``, and the outcome of a comparison (or of any other Boolean expression) may be negated with ``not``. These have lower priorities than comparison operators; between them, ``not`` has the highest priority and ``or`` the lowest, so that ``A and not B or C`` is equivalent to ``(A and (not B)) or C``. As always, parentheses can be used to express the desired composition.
ru: Сравнения могут быть объединены с использованием логических операторов ``and`` и ``or``, и результат сравнения (или любого другого логического выражения) можно отрицать с помощью ``not``. Они имеют более низкий приоритет, чем операторы сравнения; среди них ``not`` имеет наивысший приоритет, а ``or`` - наименьший, так что ``A and not B or C`` эквивалентно ``(A and (not B)) or C``. Как всегда, скобки могут быть использованы для выражения желаемой композиции.

source: Footnotes
ru: Сноски
