Repository: MLGRussianXP/python-docs-ru
Catalog: tutorial/whatnow.po
Languages: ru

source: What Now?
ru: Что далее?

source: Reading this tutorial has probably reinforced your interest in using Python --- you should be eager to apply Python to solving your real-world problems. Where should you go to learn more?
ru: Чтение этого учебника, вероятно, усилило ваш интерес к применению Python --- вам, верно, не терпится использовать Python для решения реальных задач. Где можно узнать больше?

source: This tutorial is part of Python's documentation set. Some other documents in the set are:
ru: Настоящий учебник --- часть документации Python. Другие документы читайте в:

source: You should browse through this manual, which gives complete (though terse) reference material about types, functions, and the modules in the standard library. The standard Python distribution includes a *lot* of additional code. There are modules to read Unix mailboxes, retrieve documents via HTTP, generate random numbers, parse command-line options, compress data, and many other tasks. Skimming through the Library Reference will give you an idea of what's available.
ru: Вам следует просмотреть эту инструкцию, которая предоставляет полный (хотя и сжатый) справочный материал о типах, функциях и модулях в стандартной библиотеке. Стандартный дистрибутив Python включает *много* дополнительного кода. Есть модули для чтения почтовых ящиков Unix, получения документов через HTTP, генерации случайных чисел, анализа параметров командной строки, сжатия данных и многих других задач. Просмотр Справочника Библиотеки даст вам представление о доступных возможностях.

source: :ref:`installing-index` explains how to install additional modules written by other Python users.
ru: Документ :ref:`installing-index` объясняет как установить дополнительные модули, написанные сторонними разработчиками Python.

source: :ref:`reference-index`: A detailed explanation of Python's syntax and semantics. It's heavy reading, but is useful as a complete guide to the language itself.
ru: :ref:`reference-index`: Подробный разбор синтаксиса и семантики Python. Это трудный для чтения документ, но полезное полное руководство по собственно языку Python.

source: More Python resources:
ru: Другие ресурсы Python:

source: https://www.python.org: The major Python web site. It contains code, documentation, and pointers to Python-related pages around the web.
ru: https://www.python.org: Основной веб-сайт Python. Он содержит код, документацию и указатели на страницы, связанные с Python, в Интернете.

source: https://docs.python.org: Fast access to Python's documentation.
ru: https://docs.python.org: Быстрый доступ к документации Python.

source: https://pypi.org: The Python Package Index, previously also nicknamed the Cheese Shop [#]_, is an index of user-created Python modules that are available for download. Once you begin releasing code, you can register it here so that others can find it.
ru: https://pypi.org: Индекс пакетов Python (the Python Package Index), известный под шутливым именем the Cheese Shop [#]_, (Сырная Лавка), представляет собой индекс доступных для загрузки модулей Python, написанных сторонними разработчиками. Если вы захотите распространить собственный код, зарегистрируйтесь здесь, чтобы другие программисты могли найти его.

source: https://code.activestate.com/recipes/langs/python/: The Python Cookbook is a sizable collection of code examples, larger modules, and useful scripts. Particularly notable contributions are collected in a book also titled Python Cookbook (O'Reilly & Associates, ISBN 0-596-00797-3.)
ru: https://code.activestate.com/recipes/langs/python/: The Python Cookbook (книга рецептов) изрядная коллекция примеров кода, крупных модулей и полезных скриптов. Наиболее полезные рецепты собраны в книге Python Cookbook (O’Reilly & Associates, ISBN 0-596-00797-3), см. рус. перевод “Бизли Д., Джонс Б. К. Python. Книга рецептов” (ДМК Пресс, 2019, ISBN 978-5-97060-751-0).

source: https://pyvideo.org collects links to Python-related videos from conferences and user-group meetings.
ru: https://pyvideo.org собирает ссылки на видео, связанные с Python, с конференций и встреч групп пользователей.

source: https://scipy.org: The Scientific Python project includes modules for fast array computations and manipulations plus a host of packages for such things as linear algebra, Fourier transforms, non-linear solvers, random number distributions, statistical analysis and the like.
ru: https://scipy.org: Здесь собраны модули проекта The Scientific Python project для векторных и матричных вычислений, задач линейной алгебры, преобразований Фурье, нелинейных задач, случайных распределений, статистического анализа и тому подобных тем.

source: For Python-related questions and problem reports, you can post to the newsgroup :newsgroup:`comp.lang.python`, or send them to the mailing list at python-list@python.org. The newsgroup and mailing list are gatewayed, so messages posted to one will automatically be forwarded to the other. There are hundreds of postings a day, asking (and answering) questions, suggesting new features, and announcing new modules. Mailing list archives are available at https://mail.python.org/pipermail/.
ru: Вопросы и проблемы, относящиеся к Python, обсуждаются в группе новостей (newsgroup) :newsgroup:`comp.lang.python` и в списке рассылки (mailing list) python-list@python.org. Эти два ресурса связаны шлюзом (gateway), таким образом что сообщение, отправленное в один из них, автоматически будет переслано в другой. Здесь ежедневно появляются сотни новых сообщений с вопросами и ответами на них, предлагаются новые фичи, анонсируются новые модули. Архив списка рассылки доступен по адресу https://mail.python.org/pipermail/.

source: Before posting, be sure to check the list of :ref:`Frequently Asked Questions <faq-index>` (also called the FAQ). The FAQ answers many of the questions that come up again and again, and may already contain the solution for your problem.
ru: Прежде чем задать вопрос, прочитайте ЧАВО (ЧАсто задаваемые ВОпросы) :ref:`Frequently Asked Questions <faq-index>` (называемый также FAQ). Возможно, ЧАВО уже содержит ответ на ваш вопрос.

source: Footnotes
ru: Сноски

source: "Cheese Shop" is a Monty Python's sketch: a customer enters a cheese shop, but whatever cheese he asks for, the clerk says it's missing.
ru: “Сырная лавка” (англ. “Cheese Shop”) это скетч комедийной группы Monty Python: покупатель заходит в сырный магазинчик, но какой сорт ни спросит, продавец отвечает, что только-что закончился, ой мышь доела последнюю крошку и т.д.
