Repository: MLGRussianXP/python-docs-ru
Catalog: about.po
Languages: ru

source: About these documents
ru: Об этой документации

source: These documents are generated from `reStructuredText`_ sources by `Sphinx`_, a document processor specifically written for the Python documentation.
ru: Документация сгенерирована из файлов `reStructuredText`_ с помощью `Sphinx`_, генератора документации, созданного специально для Python.

source: Development of the documentation and its toolchain is an entirely volunteer effort, just like Python itself. If you want to contribute, please take a look at the :ref:`reporting-bugs` page for information on how to do so. New volunteers are always welcome!
ru: Разработка и совершенствование данной документации и ее инструментов, как и весь проект Python поддерживается добровольцами. Вся информация о том как внести свой вклад в развитие проекта находится на :ref:`reporting-bugs` этой странице. Мы всегда рады новым людям!

source: Many thanks go to:
ru: Мы благодарны:

source: Fred L. Drake, Jr., the creator of the original Python documentation toolset and writer of much of the content;
ru: Fred L. Drake, Jr., создателю инструментов документации Python и автору большой ее части;

source: the `Docutils <https://docutils.sourceforge.io/>`_ project for creating reStructuredText and the Docutils suite;
ru: проекту `Docutils <https://docutils.sourceforge.io/>`_ за создание reStructuredText и библиотеки Docutils;

source: Fredrik Lundh for his Alternative Python Reference project from which Sphinx got many good ideas.
ru: Fredrik Lundh за его проект Alternative Python Reference, из которого Sphinx почерпнул много хороших идей.

source: Contributors to the Python Documentation
ru: Контрибьюторам Документации Python

source: Many people have contributed to the Python language, the Python standard library, and the Python documentation. See :source:`Misc/ACKS` in the Python source distribution for a partial list of contributors.
ru: Множество люди внесли свой вклад в язык Python, стандартную библиотеку Python и документацию Python. Частичный список контрибьюторов можно найти здесь: :source:`Misc/ACKS`

source: It is only with the input and contributions of the Python community that Python has such wonderful documentation -- Thank You!
ru: Только благодаря помощи контрибьюторов и python-сообществу y Python появилась такая замечательная документация – Спасибо Вам!
