Repository: MLGRussianXP/python-docs-ru
Catalog: library/functions.po
Languages: ru

source: Return *base* to the power *exp*; if *mod* is present, return *base* to the power *exp*, modulo *mod* (computed more efficiently than ``pow(base, exp) % mod``). The two-argument form ``pow(base, exp)`` is equivalent to using the power operator: ``base**exp``.
ru: Возвращает *base* в степени *exp*; если указан *mod*, возвращает *base* в степени *exp*, по модулю *mod* (вычислено более эффективно, чем ``pow(base, exp) % mod``). Двухаргументная форма ``pow(base, exp)`` эквивалентна использованию оператора возведения в степень: ``base**exp``.

source: The arguments must have numeric types. With mixed operand types, the coercion rules for binary arithmetic operators apply. For :class:`int` operands, the result has the same type as the operands (after coercion) unless the second argument is negative; in that case, all arguments are converted to float and a float result is delivered. For example, ``pow(10, 2)`` returns ``100``, but ``pow(10, -2)`` returns ``0.01``. For a negative base of type :class:`int` or :class:`float` and a non-integral exponent, a complex result is delivered. For example, ``pow(-9, 0.5)`` returns a value close to ``3j``.
ru: Аргументы должны иметь числовые типы. Смешанные типы операндов подчиняются правилам приведения для бинарных арифметических операторов. Для операндов типа :class:`int` результат имеет тот же тип, что и операнды (после приведения), если только второй аргумент не является отрицательным; в этом случае все аргументы преобразуются в тип *float* и возвращается результат типа *float*. Например, ``pow(10, 2)`` возвращает ``100``, но ``pow(10, -2)`` возвращает ``0.01``. Для отрицательного основания типа :class:`int` или :class:`float` и нецелого показателя возвращается комплексный результат. Например, ``pow(-9, 0.5)`` возвращает значение, близкое к ``3j``.

source: For :class:`int` operands *base* and *exp*, if *mod* is present, *mod* must also be of integer type and *mod* must be nonzero. If *mod* is present and *exp* is negative, *base* must be relatively prime to *mod*. In that case, ``pow(inv_base, -exp, mod)`` is returned, where *inv_base* is an inverse to *base* modulo *mod*.
ru: Для :class:`int` операндов *base* и *exp*, если *mod* присутствует, *mod* также должен быть целого типа и *mod* должен быть ненулевым. Если *mod* присутствует и *exp* отрицательное, *base* должно быть взаимно простым с *mod*. В этом случае возвращается ``pow(inv_base, -exp, mod)``, где *inv_base* является обратным к *base* по модулю *mod*.

source: Here's an example of computing an inverse for ``38`` modulo ``97``::
ru: Вот пример вычисления обратного значения для ``38`` по модулю ``97``::

source: For :class:`int` operands, the three-argument form of ``pow`` now allows the second argument to be negative, permitting computation of modular inverses.
ru: Для операндов :class:`int` теперь трехаргументная форма ``pow`` позволяет второму аргументу быть отрицательным, что позволяет вычислять модульные обратные значения.

source: Allow keyword arguments. Formerly, only positional arguments were supported.
ru: Разрешены именованные аргументы. Ранее поддерживались только позиционные аргументы.

source: Print *objects* to the text stream *file*, separated by *sep* and followed by *end*. *sep*, *end*, *file*, and *flush*, if present, must be given as keyword arguments.
ru: Печатает *objects* в поток текста *file*, разделенные *sep* и с последующим *end*. *sep*, *end*, *file* и *flush*, если они присутствуют, должны быть указаны в виде именованных аргументов.

source: All non-keyword arguments are converted to strings like :func:`str` does and written to the stream, separated by *sep* and followed by *end*. Both *sep* and *end* must be strings; they can also be ``None``, which means to use the default values. If no *objects* are given, :func:`print` will just write *end*.
ru: Все неименованные аргументы преобразуются в строки, как это делает функция :func:`str`, и записываются в поток, разделенные *sep* и с последующим *end*. И *sep*, и *end* должны быть строками; они также могут быть ``None``, что означает использование значений по умолчанию. Если *objects* не указаны, :func:`print` просто запишет *end*.

source: The *file* argument must be an object with a ``write(string)`` method; if it is not present or ``None``, :data:`sys.stdout` will be used. Since printed arguments are converted to text strings, :func:`print` cannot be used with binary mode file objects. For these, use ``file.write(...)`` instead.
ru: Аргумент *file* должен быть объектом с методом ``write(string)``; если он отсутствует или равен ``None``, будет использоваться :data:`sys.stdout`. Поскольку аргументы для печати преобразуются в текстовые строки, :func:`print` нельзя использовать с файловыми объектами в двоичном режиме. Вместо этого используйте ``file.write(...)``.

source: Output buffering is usually determined by *file*. However, if *flush* is true, the stream is forcibly flushed.
ru: Буферизация вывода обычно определяется *file*. Однако, если *flush* истинный, поток принудительно сбрасывается.

source: Added the *flush* keyword argument.
ru: Добавлен именованный аргумент *flush*.

source: Return a property attribute.
ru: Возвращает атрибут свойства.

source: *fget* is a function for getting an attribute value. *fset* is a function for setting an attribute value. *fdel* is a function for deleting an attribute value. And *doc* creates a docstring for the attribute.
ru: *fget* - функция для получения значения атрибута. *fset* - функция для установки значения атрибута. *fdel* - функция для удаления значения атрибута. И *doc* создает строку документации для атрибута.

source: A typical use is to define a managed attribute ``x``::
ru: Типичное использование - определение управляемого атрибута ``x``::

source: If *c* is an instance of *C*, ``c.x`` will invoke the getter, ``c.x = value`` will invoke the setter, and ``del c.x`` the deleter.
ru: Если *c* является экземпляром *C*, ``c.x`` вызовет геттер, ``c.x = value`` вызовет сеттер, а ``del c.x`` удалит его.

source: If given, *doc* will be the docstring of the property attribute. Otherwise, the property will copy *fget*'s docstring (if it exists). This makes it possible to create read-only properties easily using :func:`property` as a :term:`decorator`::
ru: Если указано, *doc* будет строкой документации атрибута свойства. В противном случае, свойство будет копировать строку документации *fget* (если она существует). Это позволяет легко создавать свойства только для чтения, используя :func:`property` в качестве :term:`декоратора`::

source: The ``@property`` decorator turns the :meth:`!voltage` method into a "getter" for a read-only attribute with the same name, and it sets the docstring for *voltage* to "Get the current voltage."
ru: Декоратор ``@property`` превращает метод :meth:`!voltage` в "геттер" для атрибута только-для-чтения с тем же именем, и устанавливает строку документации для *voltage* равной "Get the current voltage."

source: A property object has ``getter``, ``setter``, and ``deleter`` methods usable as decorators that create a copy of the property with the corresponding accessor function set to the decorated function. This is best explained with an example:
ru: Объект свойства имеет методы ``getter``, ``setter`` и ``deleter``, которые можно использовать в качестве декораторов, создающих копию свойства с соответствующей функцией доступа, установленной в декорированную функцию. Это лучше всего объяснить на примере:

source: This code is exactly equivalent to the first example. Be sure to give the additional functions the same name as the original property (``x`` in this case.)
ru: Этот код полностью эквивалентен первому примеру. Убедитесь, что дополнительные функции имеют то же самое имя, что и исходное свойство (в данном случае ``x``.)

source: The returned property object also has the attributes ``fget``, ``fset``, and ``fdel`` corresponding to the constructor arguments.
ru: Возвращаемый объект свойства также имеет атрибуты ``fget``, ``fset`` и ``fdel``, соответствующие аргументам конструктора.

source: The docstrings of property objects are now writeable.
ru: Строки документации свойств теперь можно изменять.

source: Rather than being a function, :class:`range` is actually an immutable sequence type, as documented in :ref:`typesseq-range` and :ref:`typesseq`.
ru: Вместо того чтобы быть функцией, :class:`range` на самом деле является неизменяемым типом последовательности, как документировано в :ref:`typesseq-range` и :ref:`typesseq`.

source: Return a string containing a printable representation of an object. For many types, this function makes an attempt to return a string that would yield an object with the same value when passed to :func:`eval`; otherwise, the representation is a string enclosed in angle brackets that contains the name of the type of the object together with additional information often including the name and address of the object. A class can control what this function returns for its instances by defining a :meth:`~object.__repr__` method. If :func:`sys.displayhook` is not accessible, this function will raise :exc:`RuntimeError`.
ru: Возвращает строку, содержащую печатаемое представление объекта. Для многих типов эта функция пытается вернуть строку, которая бы выдала объект с тем же значением при передаче в :func:`eval`; в противном случае, представление - это строка, заключенная в угловые скобки, которая содержит имя типа объекта вместе с дополнительной информацией, часто включающей имя и адрес объекта. Класс может контролировать, что эта функция возвращает для его экземпляров, определяя метод :meth:`~object.__repr__`. Если :func:`sys.displayhook` недоступен, эта функция вызовет :exc:`RuntimeError`.

source: Return a reverse :term:`iterator`. *seq* must be an object which has a :meth:`~object.__reversed__` method or supports the sequence protocol (the :meth:`~object.__len__` method and the :meth:`~object.__getitem__` method with integer arguments starting at ``0``).
ru: Возвращает обратный :term:`итератор`. *seq* должен быть объектом, который имеет метод :meth:`~object.__reversed__` или поддерживает протокол последовательности (методы :meth:`~object.__len__` и :meth:`~object.__getitem__` с целыми числовыми аргументами, начинающимися с ``0``).

source: Return *number* rounded to *ndigits* precision after the decimal point. If *ndigits* is omitted or is ``None``, it returns the nearest integer to its input.
ru: Возвращает *number* округленное до *ndigits* точности после десятичной запятой. Если *ndigits* опущено или равно ``None``, то возвращается ближайшее целое число к входному значению.

source: For the built-in types supporting :func:`round`, values are rounded to the closest multiple of 10 to the power minus *ndigits*; if two multiples are equally close, rounding is done toward the even choice (so, for example, both ``round(0.5)`` and ``round(-0.5)`` are ``0``, and ``round(1.5)`` is ``2``). Any integer value is valid for *ndigits* (positive, zero, or negative). The return value is an integer if *ndigits* is omitted or ``None``. Otherwise, the return value has the same type as *number*.
ru: Для встроенных типов, поддерживающих функцию :func:`round`, значения округляются до ближайшего кратного 10 в степени минус *ndigits*; если два кратных значения одинаково близки, округление происходит в сторону четного выбора (таким образом, например, и ``round(0.5)``, и ``round(-0.5)`` равны ``0``, а ``round(1.5)`` равно ``2``). Любое целое значение является верным для *ndigits* (положительное, нулевое или отрицательное). Возвращаемое значение является целым числом, если *ndigits* опущено или равно ``None``. В противном случае, возвращаемое значение имеет тот же тип, что и *number*.

source: For a general Python object ``number``, ``round`` delegates to ``number.__round__``.
ru: Для общего объекта Python ``number``, ``round`` делегирует вызов ``number.__round__``.

source: The behavior of :func:`round` for floats can be surprising: for example, ``round(2.675, 2)`` gives ``2.67`` instead of the expected ``2.68``. This is not a bug: it's a result of the fact that most decimal fractions can't be represented exactly as a float. See :ref:`tut-fp-issues` for more information.
ru: Поведение :func:`round` для чисел с плавающей запятой может быть удивительным: например, ``round(2.675, 2)`` дает ``2.67`` вместо ожидаемого ``2.68``. Это не ошибка: это результат того факта, что большинство десятичных дробей не могут быть точно представлены в виде чисел с плавающей запятой. См. :ref:`tut-fp-issues` для получения дополнительной информации.

source: Return a new :class:`set` object, optionally with elements taken from *iterable*. ``set`` is a built-in class. See :class:`set` and :ref:`types-set` for documentation about this class.
ru: Возвращает новый объект :class:`set`, опционально с элементами, взятыми из *iterable*. ``set`` - это встроенный класс. См. :class:`set` и :ref:`types-set` для документации об этом классе.

source: For other containers see the built-in :class:`frozenset`, :class:`list`, :class:`tuple`, and :class:`dict` classes, as well as the :mod:`collections` module.
ru: Для других контейнеров см. встроенные классы :class:`frozenset`, :class:`list`, :class:`tuple` и :class:`dict`, а также модуль :mod:`collections`.

source: This is the counterpart of :func:`getattr`. The arguments are an object, a string, and an arbitrary value. The string may name an existing attribute or a new attribute. The function assigns the value to the attribute, provided the object allows it. For example, ``setattr(x, 'foobar', 123)`` is equivalent to ``x.foobar = 123``.
ru: Это аналог :func:`getattr`. Аргументы - это объект, строка и произвольное значение. Строка может называть существующий или новый атрибут. Функция присваивает значение атрибуту, если объект позволяет это сделать. Например, ``setattr(x, 'foobar', 123)`` эквивалентно ``x.foobar = 123``.

source: *name* need not be a Python identifier as defined in :ref:`identifiers` unless the object chooses to enforce that, for example in a custom :meth:`~object.__getattribute__` or via :attr:`~object.__slots__`. An attribute whose name is not an identifier will not be accessible using the dot notation, but is accessible through :func:`getattr` etc..
ru: *name* не обязательно должно быть идентификатором Python, как определено в :ref:`identifiers`, если объект выбирает принудительное выполнение этого, например, в пользовательском :meth:`~object.__getattribute__` или через :attr:`~object.__slots__`. Атрибут, имя которого не является идентификатором, не будет доступен с использованием точечной нотации, но доступен через :func:`getattr` и т.д..

source: Since :ref:`private name mangling <private-name-mangling>` happens at compilation time, one must manually mangle a private attribute's (attributes with two leading underscores) name in order to set it with :func:`setattr`.
ru: Так как :ref:`искажение приватных имён <private-name-mangling>` происходит во время компиляции, необходимо вручную изменить имя приватного атрибута (атрибуты с двумя ведущими подчеркиваниями), чтобы установить его с помощью :func:`setattr`.

source: Return a :term:`slice` object representing the set of indices specified by ``range(start, stop, step)``. The *start* and *step* arguments default to ``None``.
ru: Возвращает объект :term:`slice`, представляющий набор индексов, указанных с помощью ``range(start, stop, step)``. Аргументы *start* и *step* по умолчанию равны ``None``.

source: Slice objects have read-only data attributes :attr:`!start`, :attr:`!stop`, and :attr:`!step` which merely return the argument values (or their default). They have no other explicit functionality; however, they are used by NumPy and other third-party packages.
ru: Объекты отрезка имеют атрибуты данных только-для-чтения :attr:`!start`, :attr:`!stop` и :attr:`!step`, которые просто возвращают значения аргументов (или их значения по умолчанию). У них нет другой явной функциональности; однако они используются NumPy и другими сторонними пакетами.

source: Slice objects are also generated when extended indexing syntax is used. For example: ``a[start:stop:step]`` or ``a[start:stop, i]``. See :func:`itertools.islice` for an alternate version that returns an :term:`iterator`.
ru: Объекты отрезков также создаются при использовании расширенного синтаксиса индексирования. Например: ``a[start:stop:step]`` или ``a[start:stop, i]``. См. :func:`itertools.islice` для альтернативной версии, которая возвращает :term:`итератор`.

source: Slice objects are now :term:`hashable` (provided :attr:`~slice.start`, :attr:`~slice.stop`, and :attr:`~slice.step` are hashable).
ru: Объекты отрезков теперь являются хэшируемыми (при условии, что :attr:`~slice.start`, :attr:`~slice.stop` и :attr:`~slice.step` являются хэшируемыми).

source: Return a new sorted list from the items in *iterable*.
ru: Возвращает новый отсортированный список из элементов в *iterable*.

source: Has two optional arguments which must be specified as keyword arguments.
ru: Имеет два необязательных аргумента, которые должны быть указаны как именованные аргументы.

source: *key* specifies a function of one argument that is used to extract a comparison key from each element in *iterable* (for example, ``key=str.lower``). The default value is ``None`` (compare the elements directly).
ru: *key* указывает на функцию с одним аргументом, которая используется для извлечения ключа сравнения из каждого элемента в *iterable* (например, ``key=str.lower``). Значение по умолчанию - ``None`` (сравнение элементов напрямую).

source: *reverse* is a boolean value. If set to ``True``, then the list elements are sorted as if each comparison were reversed.
ru: *reverse* - логическое значение. Если установлено значение ``True``, то элементы списка сортируются так, как если бы каждое сравнение было обратным.

source: Use :func:`functools.cmp_to_key` to convert an old-style *cmp* function to a *key* function.
ru: Используйте :func:`functools.cmp_to_key` для преобразования старого стиля функции *cmp* в функцию *key*.

source: The built-in :func:`sorted` function is guaranteed to be stable. A sort is stable if it guarantees not to change the relative order of elements that compare equal --- this is helpful for sorting in multiple passes (for example, sort by department, then by salary grade).
ru: Встроенная функция :func:`sorted` гарантирует стабильность. Сортировка является стабильной, если она гарантирует сохранение относительного порядка элементов, которые сравниваются как равные --- это полезно для сортировки в несколько проходов (например, сортировка по отделу, затем по уровню зарплаты).

source: The sort algorithm uses only ``<`` comparisons between items. While defining an :meth:`~object.__lt__` method will suffice for sorting, :PEP:`8` recommends that all six :ref:`rich comparisons <comparisons>` be implemented. This will help avoid bugs when using the same data with other ordering tools such as :func:`max` that rely on a different underlying method. Implementing all six comparisons also helps avoid confusion for mixed type comparisons which can call reflected the :meth:`~object.__gt__` method.
ru: Алгоритм сортировки использует только сравнения ``<`` между элементами. В то время как определение метода :meth:`~object.__lt__` будет достаточно для сортировки, :PEP:`8` рекомендует реализовать все шесть :ref:`расширенных сравнений <comparisons>`. Это поможет избежать ошибок при использовании тех же данных с другими инструментами упорядочивания, такими как :func:`max`, которые полагаются на другой базовый метод. Реализация всех шести сравнений также помогает избежать путаницы при сравнении смешанных типов, которые могут вызывать отраженный метод :meth:`~object.__gt__`.

source: For sorting examples and a brief sorting tutorial, see :ref:`sortinghowto`.
ru: Для примеров сортировки и краткого руководства по сортировке см. :ref:`sortinghowto`.

source: Transform a method into a static method.
ru: Преобразовывает метод в статический метод.

source: A static method does not receive an implicit first argument. To declare a static method, use this idiom::
ru: Статический метод не получает неявный первый аргумент. Чтобы объявить статический метод, используйте эту идиому::

source: The ``@staticmethod`` form is a function :term:`decorator` -- see :ref:`function` for details.
ru: Форма ``@staticmethod`` является :term:`декоратором` функции - см. :ref:`function` для получения подробной информации.

source: A static method can be called either on the class (such as ``C.f()``) or on an instance (such as ``C().f()``). Moreover, they can be called as regular functions (such as ``f()``).
ru: Статический метод может быть вызван как на классе (например, ``C.f()``), так и на экземпляре (например, ``C().f()``). Более того, их можно вызывать как обычные функции (например, ``f()``).

source: Static methods in Python are similar to those found in Java or C++. Also, see :func:`classmethod` for a variant that is useful for creating alternate class constructors.
ru: Статические методы в Python аналогичны тем, которые можно найти в Java или C++. Также см. :func:`classmethod` для варианта, который полезен для создания альтернативных конструкторов класса.

source: Like all decorators, it is also possible to call ``staticmethod`` as a regular function and do something with its result. This is needed in some cases where you need a reference to a function from a class body and you want to avoid the automatic transformation to instance method. For these cases, use this idiom::
ru: Как и все декораторы, также возможно вызвать ``staticmethod`` как обычную функцию и сделать что-нибудь с ее результатом. Это необходимо в некоторых случаях, когда вам нужна ссылка на функцию из тела класса и вы хотите избежать автоматического преобразования в метод экземпляра. Для таких случаев используйте эту идиому::

source: For more information on static methods, see :ref:`types`.
ru: Для получения дополнительной информации о статических методах см. :ref:`types`.

source: Static methods now inherit the method attributes (``__module__``, ``__name__``, ``__qualname__``, ``__doc__`` and ``__annotations__``), have a new ``__wrapped__`` attribute, and are now callable as regular functions.
ru: Статические методы теперь наследуют атрибуты метода (``__module__``, ``__name__``, ``__qualname__``, ``__doc__`` и ``__annotations__``), имеют новый атрибут ``__wrapped__`` и теперь могут быть вызваны как обычные функции.

source: Return a :class:`str` version of *object*. See :func:`str` for details.
ru: Возвращает :class:`str` версию *object*. См. :func:`str` для подробностей.

source: ``str`` is the built-in string :term:`class`. For general information about strings, see :ref:`textseq`.
ru: ``str`` это встроенный :term:`класс` строки. Для получения общей информации о строках см. :ref:`textseq`.

source: Sums *start* and the items of an *iterable* from left to right and returns the total. The *iterable*'s items are normally numbers, and the start value is not allowed to be a string.
ru: Суммирует *start* и элементы *iterable* слева направо и возвращает итоговую сумму. Элементы *iterable* обычно являются числами, и значение *start* не может быть строкой.
