Repository: MLGRussianXP/python-docs-ru
Catalog: library/functions.po
Languages: ru

source: Built-in Functions
ru: Встроенные функции

source: The Python interpreter has a number of functions and types built into it that are always available. They are listed here in alphabetical order.
ru: Интерпретатор Python имеет ряд встроенных функций и типов, которые доступны всегда. Они перечислены здесь в алфавитном порядке.

source: Return the absolute value of a number. The argument may be an integer, a floating point number, or an object implementing :meth:`~object.__abs__`. If the argument is a complex number, its magnitude is returned.
ru: Возвращает абсолютное значение числа. Аргументом может быть целое число, число с плавающей точкой или объект, реализующий :meth:`~object.__abs__`. Если аргумент является комплексным числом, возвращается его модуль.

source: Return an :term:`asynchronous iterator` for an :term:`asynchronous iterable`. Equivalent to calling ``x.__aiter__()``.
ru: Возвращает :term:`asynchronous iterator` для :term:`asynchronous iterable`. Эквивалент вызова ``x.__aiter__()``.

source: Note: Unlike :func:`iter`, :func:`aiter` has no 2-argument variant.
ru: Примечание: В отличие от :func:`iter`, у :func:`aiter` нет варианта с двумя аргументами.

source: Return ``True`` if all elements of the *iterable* are true (or if the iterable is empty). Equivalent to::
ru: Возвращает ``True``, если все элементы *iterable* истинны (или если итерируемый объект пуст). Эквивалентно::

source: When awaited, return the next item from the given :term:`asynchronous iterator`, or *default* if given and the iterator is exhausted.
ru: При использовании await, возвращается следующий элемент из заданного :term:`asynchronous iterator`, или *default*, если он задан и итератор исчерпан.

source: This is the async variant of the :func:`next` builtin, and behaves similarly.
ru: Это асинхронный вариант встроенной функции :func:`next`, и ведёт себя аналогично.

source: This calls the :meth:`~object.__anext__` method of *async_iterator*, returning an :term:`awaitable`. Awaiting this returns the next value of the iterator. If *default* is given, it is returned if the iterator is exhausted, otherwise :exc:`StopAsyncIteration` is raised.
ru: Это вызывает метод :meth:`~object.__anext__` *async_iterator*, возвращая :term:`awaitable`. Использование await возвращает следующее значение итератора. Если *default* задан, то он возвращается, если итератор исчерпан, в противном случае возбуждается исключение :exc:`StopAsyncIteration`.

source: Return ``True`` if any element of the *iterable* is true. If the iterable is empty, return ``False``. Equivalent to::
ru: Возвращает ``True``, если любой элемент *итерируемого объекта* истинный. Если итерируемый объект пуст, возвращает ``False``. Эквивалентно::

source: As :func:`repr`, return a string containing a printable representation of an object, but escape the non-ASCII characters in the string returned by :func:`repr` using ``\x``, ``\u``, or ``\U`` escapes. This generates a string similar to that returned by :func:`repr` in Python 2.
ru: Как :func:`repr`, возвращает строку, содержащую печатное представление объекта, но экранирует не-ASCII символы в строке, возвращаемой :func:`repr`, используя экранирование ``\x``, ``\u`` или ``\U`` . Это генерирует строку, аналогичную той, которую возвращает :func:`repr` в Python 2.

source: Convert an integer number to a binary string prefixed with "0b". The result is a valid Python expression. If *x* is not a Python :class:`int` object, it has to define an :meth:`~object.__index__` method that returns an integer. Some examples:
ru: Преобразует целое число в двоичную строку с префиксом "0b". Результат является допустимым выражением Python. Если *x* не является объектом Python :class:`int`, он должен определить метод :meth:`~object.__index__`, который возвращает целое число. Некоторые примеры:

source: If the prefix "0b" is desired or not, you can use either of the following ways.
ru: В зависимости от необходимости префикса "0b", вы можете использовать любой из следующих способов.

source: See also :func:`format` for more information.
ru: См. также :func:`format` для получения дополнительной информации.

source: Return a Boolean value, i.e. one of ``True`` or ``False``. *x* is converted using the standard :ref:`truth testing procedure <truth>`. If *x* is false or omitted, this returns ``False``; otherwise, it returns ``True``. The :class:`bool` class is a subclass of :class:`int` (see :ref:`typesnumeric`). It cannot be subclassed further. Its only instances are ``False`` and ``True`` (see :ref:`typebool`).
ru: Возвращает Логическое значение, т. е. одно из ``True`` или ``False``. *x* преобразуется с использованием стандартной :ref:`truth testing procedure <truth>`. Если *x* ложно или опущено, возвращается ``False``; в противном случае возвращается ``True``. Класс :class:`bool` является подклассом :class:`int` (см. :ref:`typesnumeric`). Он не может быть наследован дальше. Его единственные экземпляры - ``False`` и ``True`` (см. :ref:`typebool`).

source: *x* is now a positional-only parameter.
ru: *x* теперь является только-позиционным параметром.

source: This function drops you into the debugger at the call site. Specifically, it calls :func:`sys.breakpointhook`, passing ``args`` and ``kws`` straight through. By default, ``sys.breakpointhook()`` calls :func:`pdb.set_trace()` expecting no arguments. In this case, it is purely a convenience function so you don't have to explicitly import :mod:`pdb` or type as much code to enter the debugger. However, :func:`sys.breakpointhook` can be set to some other function and :func:`breakpoint` will automatically call that, allowing you to drop into the debugger of choice. If :func:`sys.breakpointhook` is not accessible, this function will raise :exc:`RuntimeError`.
ru: Эта функция помещает вас в отладчик на месте вызова. Конкретно, она вызывает :func:`sys.breakpointhook`, передавая ``args`` и ``kws`` напрямую. По умолчанию ``sys.breakpointhook()`` вызывает :func:`pdb.set_trace()` без аргументов. В этом случае это просто функция удобства, чтобы вам не нужно было явно импортировать :mod:`pdb` или печатать много кода для входа в отладчик. Однако :func:`sys.breakpointhook` может быть установлена на другую функцию, и :func:`breakpoint` автоматически вызовет ее, позволяя вам попасть в отладчик по выбору. Если :func:`sys.breakpointhook` недоступна, эта функция возбудит :exc:`RuntimeError`.

source: By default, the behavior of :func:`breakpoint` can be changed with the :envvar:`PYTHONBREAKPOINT` environment variable. See :func:`sys.breakpointhook` for usage details.
ru: По умолчанию поведение функции :func:`breakpoint` может быть изменено с помощью переменной окружения :envvar:`PYTHONBREAKPOINT`. См. детали использования в :func:`sys.breakpointhook`.

source: Note that this is not guaranteed if :func:`sys.breakpointhook` has been replaced.
ru: Обратите внимание, что это не гарантируется, если :func:`sys.breakpointhook` был заменен.

source: Raises an :ref:`auditing event <auditing>` ``builtins.breakpoint`` with argument ``breakpointhook``.
ru: Возбуждает событие аудита ``builtins.breakpoint`` с аргументом ``breakpointhook``.

source: Return a new array of bytes. The :class:`bytearray` class is a mutable sequence of integers in the range 0 <= x < 256. It has most of the usual methods of mutable sequences, described in :ref:`typesseq-mutable`, as well as most methods that the :class:`bytes` type has, see :ref:`bytes-methods`.
ru: Возвращает новый массив байтов. Класс :class:`bytearray` является изменяемой последовательностью целых чисел в диапазоне 0 <= x < 256. Он имеет большинство обычных методов изменяемых последовательностей, описанных в :ref:`typesseq-mutable`, а также большинство методов, которые имеет тип :class:`bytes`, см. :ref:`bytes-methods`.

source: The optional *source* parameter can be used to initialize the array in a few different ways:
ru: Необязательный параметр *source* может быть использован для инициализации массива несколькими различными способами:

source: If it is a *string*, you must also give the *encoding* (and optionally, *errors*) parameters; :func:`bytearray` then converts the string to bytes using :meth:`str.encode`.
ru: Если это *строка*, вы также должны указать параметры *encoding* (и, при необходимости, *errors*); :func:`bytearray` затем преобразует строку в байты с использованием :meth:`str.encode`.

source: If it is an *integer*, the array will have that size and will be initialized with null bytes.
ru: Если это *целое число*, массив будет иметь такой размер и будет инициализирован нулевыми байтами.

source: If it is an object conforming to the :ref:`buffer interface <bufferobjects>`, a read-only buffer of the object will be used to initialize the bytes array.
ru: Если это объект, соответствующий :ref:`интерфейсу буфера <bufferobjects>`, будет использован только-для-чтения буфер объекта для инициализации массива байтов.

source: If it is an *iterable*, it must be an iterable of integers in the range ``0 <= x < 256``, which are used as the initial contents of the array.
ru: Если это *итерируемый объект*, он должен быть итерируемым объектом целых чисел в диапазоне ``0 <= x < 256``, которые используются в качестве начального содержимого массива.

source: Without an argument, an array of size 0 is created.
ru: Без аргумента создается массив размером 0.

source: See also :ref:`binaryseq` and :ref:`typebytearray`.
ru: Смотрите также ref:`binaryseq` и :ref:`typebytearray`

source: Return a new "bytes" object which is an immutable sequence of integers in the range ``0 <= x < 256``. :class:`bytes` is an immutable version of :class:`bytearray` -- it has the same non-mutating methods and the same indexing and slicing behavior.
ru: Возвращает новый объект "bytes", который является неизменяемой последовательностью целых чисел в диапазоне ``0 <= x < 256``. :class:`bytes` - это неизменяемая версия :class:`bytearray` - у него есть те же неизменяемые методы и то же поведение индексирования и срезов.

source: Accordingly, constructor arguments are interpreted as for :func:`bytearray`.
ru: Соответственно, аргументы конструктора интерпретируются так же, как и для :func:`bytearray`.

source: Bytes objects can also be created with literals, see :ref:`strings`.
ru: Объекты байтов также могут быть созданы с помощью литералов, см. :ref:`strings`.

source: See also :ref:`binaryseq`, :ref:`typebytes`, and :ref:`bytes-methods`.
ru: См. также :ref:`binaryseq`, :ref:`typebytes` и :ref:`bytes-methods`.

source: Return :const:`True` if the *object* argument appears callable, :const:`False` if not. If this returns ``True``, it is still possible that a call fails, but if it is ``False``, calling *object* will never succeed. Note that classes are callable (calling a class returns a new instance); instances are callable if their class has a :meth:`~object.__call__` method.
ru: Возвращает :const:`True`, если аргумент *object* является вызываемым, :const:`False`, если нет. Если это возвращает ``True``, все равно возможно, что вызов завершится неудачей, но если это ``False``, вызов *object* никогда не будет успешным. Обратите внимание, что классы являются вызываемыми (вызов класса возвращает новый экземпляр); экземпляры являются вызываемыми, если их класс имеет метод :meth:`~object.__call__`.

source: This function was first removed in Python 3.0 and then brought back in Python 3.2.
ru: Эта функция была впервые удалена в Python 3.0, а затем восстановлена в Python 3.2.

source: Return the string representing a character whose Unicode code point is the integer *i*. For example, ``chr(97)`` returns the string ``'a'``, while ``chr(8364)`` returns the string ``'€'``. This is the inverse of :func:`ord`.
ru: Возвращает строку, представляющую символ, чей кодовый номер Юникода является целым числом *i*. Например, ``chr(97)`` возвращает строку ``'a'``, в то время как ``chr(8364)`` возвращает строку ``'€'``. Это обратное действие к :func:`ord`.

source: The valid range for the argument is from 0 through 1,114,111 (0x10FFFF in base 16). :exc:`ValueError` will be raised if *i* is outside that range.
ru: Допустимый диапазон для аргумента составляет от 0 до 1,114,111 (0x10FFFF в шестнадцатеричной системе). :exc:`ValueError` будет возбуждено, если *i* находится за пределами этого диапазона.

source: Transform a method into a class method.
ru: Преобразует метод в метод класса.

source: A class method receives the class as an implicit first argument, just like an instance method receives the instance. To declare a class method, use this idiom::
ru: Метод класса получает класс в качестве неявного первого аргумента, так же как экземпляр метода получает экземпляр. Чтобы объявить метод класса, используйте эту идиому::

source: The ``@classmethod`` form is a function :term:`decorator` -- see :ref:`function` for details.
ru: Проявление ``@classmethod`` является :term:`декоратором` функции -- см. :ref:`function` для подробностей.

source: A class method can be called either on the class (such as ``C.f()``) or on an instance (such as ``C().f()``). The instance is ignored except for its class. If a class method is called for a derived class, the derived class object is passed as the implied first argument.
ru: Метод класса может быть вызван либо на самом классе (например, ``C.f()``), либо на экземпляре класса (например, ``C().f()``). Экземпляр игнорируется, за исключением его класса. Если метод класса вызывается для производного класса, объект производного класса передается как неявный первый аргумент.

source: Class methods are different than C++ or Java static methods. If you want those, see :func:`staticmethod` in this section. For more information on class methods, see :ref:`types`.
ru: Методы класса отличаются от статических методов C++ или Java. Если вам нужны последние, см. :func:`staticmethod` в этом разделе. Дополнительную информацию о методах класса см. в :ref:`types`.

source: Class methods can now wrap other :term:`descriptors <descriptor>` such as :func:`property`.
ru: Методы класса теперь могут оборачивать другие :term:`дескрипторы <descriptor>`, такие как :func:`property`.

source: Class methods now inherit the method attributes (``__module__``, ``__name__``, ``__qualname__``, ``__doc__`` and ``__annotations__``) and have a new ``__wrapped__`` attribute.
ru: Методы класса теперь наследуют атрибуты метода (``__module__``, ``__name__``, ``__qualname__``, ``__doc__`` и ``__annotations__``) и имеют новый атрибут ``__wrapped__``.

source: Class methods can no longer wrap other :term:`descriptors <descriptor>` such as :func:`property`.
ru: Классовые методы больше не могут оборачивать другие :term:`дескрипторы <descriptor>`, такие как :func:`property`.

source: Compile the *source* into a code or AST object. Code objects can be executed by :func:`exec` or :func:`eval`. *source* can either be a normal string, a byte string, or an AST object. Refer to the :mod:`ast` module documentation for information on how to work with AST objects.
ru: Компилирует *source* в код или объект AST. Объекты кода могут быть выполнены с помощью функций :func:`exec` или :func:`eval`. *source* может быть обычной строкой, байтовой строкой или объектом AST. См. документацию модуля :mod:`ast` для получения информации о работе с объектами AST.

source: The *filename* argument should give the file from which the code was read; pass some recognizable value if it wasn't read from a file (``'<string>'`` is commonly used).
ru: Аргумент *filename* должен указывать на файл, из которого был прочитан код; передайте некоторое узнаваемое значение, если код не был прочитан из файла (обычно используется ``'<string>'``).

source: The *mode* argument specifies what kind of code must be compiled; it can be ``'exec'`` if *source* consists of a sequence of statements, ``'eval'`` if it consists of a single expression, or ``'single'`` if it consists of a single interactive statement (in the latter case, expression statements that evaluate to something other than ``None`` will be printed).
ru: Аргумент *mode* определяет, какой тип кода должен быть скомпилирован; он может быть ``'exec'``, если *source* состоит из последовательности инструкций, ``'eval'``, если он состоит из одного выражения, или ``'single'``, если он состоит из одной интерактивной инструкции (в последнем случае, инструкции выражений, которые вычисляются в нечто отличное от ``None``, будут напечатаны).

source: The optional arguments *flags* and *dont_inherit* control which :ref:`compiler options <ast-compiler-flags>` should be activated and which :ref:`future features <future>` should be allowed. If neither is present (or both are zero) the code is compiled with the same flags that affect the code that is calling :func:`compile`. If the *flags* argument is given and *dont_inherit* is not (or is zero) then the compiler options and the future statements specified by the *flags* argument are used in addition to those that would be used anyway. If *dont_inherit* is a non-zero integer then the *flags* argument is it -- the flags (future features and compiler options) in the surrounding code are ignored.
ru: Необязательные аргументы *flags* и *dont_inherit* управляют активацией :ref:`опций компилятора <ast-compiler-flags>` и разрешением :ref:`будущих возможностей <future>`. Если ни один из них не указан (или оба равны нулю), код компилируется с теми же флагами, которые влияют на код, вызывающий :func:`compile`. Если указан аргумент *flags* и не указан *dont_inherit* (или равен нулю), то опции компилятора и будущие инструкции, указанные в аргументе *flags*, используются в дополнение к тем, которые все равно будут использоваться. Если *dont_inherit* - это ненулевое целое число, то аргумент *flags* - это и есть флаги (будущие возможности и опции компилятора), указанные в окружающем коде, игнорируются.

source: Compiler options and future statements are specified by bits which can be bitwise ORed together to specify multiple options. The bitfield required to specify a given future feature can be found as the :attr:`~__future__._Feature.compiler_flag` attribute on the :class:`~__future__._Feature` instance in the :mod:`__future__` module. :ref:`Compiler flags <ast-compiler-flags>` can be found in :mod:`ast` module, with ``PyCF_`` prefix.
ru: Опции компилятора и будущие инструкции указываются с помощью битов, которые можно объединять с помощью побитовой операции ИЛИ для указания нескольких опций. Битовое поле, необходимое для указания определенной будущей функции, можно найти в атрибуте :attr:`~__future__._Feature.compiler_flag` экземпляра класса :class:`~__future__._Feature` в модуле :mod:`__future__`. :ref:`Флаги компилятора <ast-compiler-flags>` можно найти в модуле :mod:`ast` с префиксом ``PyCF_``.

source: The argument *optimize* specifies the optimization level of the compiler; the default value of ``-1`` selects the optimization level of the interpreter as given by :option:`-O` options. Explicit levels are ``0`` (no optimization; ``__debug__`` is true), ``1`` (asserts are removed, ``__debug__`` is false) or ``2`` (docstrings are removed too).
ru: Аргумент *optimize* определяет уровень оптимизации компилятора; значение по умолчанию ``-1`` выбирает уровень оптимизации интерпретатора, заданный с помощью опций :option:`-O`. Явные уровни - ``0`` (без оптимизации; ``__debug__`` равно true), ``1`` (assert'ы удаляются, ``__debug__`` равно false) или ``2`` (строки документации также удаляются).

source: This function raises :exc:`SyntaxError` if the compiled source is invalid, and :exc:`ValueError` if the source contains null bytes.
ru: Эта функция возбуждает :exc:`SyntaxError`, если скомпилированный исходный код недействителен, и :exc:`ValueError`, если исходный код содержит нулевые байты.

source: If you want to parse Python code into its AST representation, see :func:`ast.parse`.
ru: Если вы хотите разобрать код на Python и получить его представление в виде AST, см. :func:`ast.parse`.

source: Raises an :ref:`auditing event <auditing>` ``compile`` with arguments ``source``, ``filename``.
ru: Возбуждает :ref:`событие аудита <auditing>` ``compile`` с аргументами ``source``, ``filename``.

source: Raises an :ref:`auditing event <auditing>` ``compile`` with arguments ``source`` and ``filename``. This event may also be raised by implicit compilation.
ru: Возбуждает :ref:`событие аудита <auditing>` ``compile`` с аргументами ``source``, ``filename``. Это событие также может быть вызвано неявной компиляцией.

source: When compiling a string with multi-line code in ``'single'`` or ``'eval'`` mode, input must be terminated by at least one newline character. This is to facilitate detection of incomplete and complete statements in the :mod:`code` module.
ru: При компиляции строки с многострочным кодом в режиме ``'single'`` или ``'eval'``, ввод должен быть завершен как минимум одним символом новой строки. Это необходимо для обнаружения неполных и полных инструкций в модуле :mod:`code`.

source: It is possible to crash the Python interpreter with a sufficiently large/complex string when compiling to an AST object due to stack depth limitations in Python's AST compiler.
ru: Возможно вызвать сбой интерпретатора Python с помощью достаточно большой/сложной строки при компиляции в объект AST из-за ограничений глубины стека в компиляторе AST Python'а.

source: Allowed use of Windows and Mac newlines. Also, input in ``'exec'`` mode does not have to end in a newline anymore. Added the *optimize* parameter.
ru: Разрешено использование новых строк Windows и Mac. Также, ввод в режиме ``'exec'`` больше не обязан заканчиваться новой строкой. Добавлен параметр *optimize*.

source: Previously, :exc:`TypeError` was raised when null bytes were encountered in *source*.
ru: Ранее, при обнаружении нулевых байтов в *source*, возбуждалось исключение :exc:`TypeError`.

source: ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT`` can now be passed in flags to enable support for top-level ``await``, ``async for``, and ``async with``.
ru: ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT`` теперь может передаваться в флаги для включения поддержки верхнего уровня ``await``, ``async for`` и ``async with``.

source: Return a complex number with the value *real* + *imag*\*1j or convert a string or number to a complex number. If the first parameter is a string, it will be interpreted as a complex number and the function must be called without a second parameter. The second parameter can never be a string. Each argument may be any numeric type (including complex). If *imag* is omitted, it defaults to zero and the constructor serves as a numeric conversion like :class:`int` and :class:`float`. If both arguments are omitted, returns ``0j``.
ru: Возвращает комплексное число со значением *real* + *imag*\*1j или преобразовывает строку или число в комплексное число. Если первый параметр является строкой, он будет интерпретирован как комплексное число, и функцию нужно вызывать без второго параметра. Второй параметр никогда не может быть строкой. Каждый аргумент может быть любым числовым типом (включая комплексные числа). Если *imag* опущен, по умолчанию он равен нулю, и конструктор служит для числового преобразования, как :class:`int` и :class:`float`. Если оба аргумента опущены, возвращается ``0j``.

source: For a general Python object ``x``, ``complex(x)`` delegates to ``x.__complex__()``. If :meth:`~object.__complex__` is not defined then it falls back to :meth:`~object.__float__`. If :meth:`!__float__` is not defined then it falls back to :meth:`~object.__index__`.
ru: Для обобщённого объекта Python ``x``, ``complex(x)`` делегирует вызов метода ``x.__complex__()``. Если метод :meth:`~object.__complex__` не определен, то вызывается метод :meth:`~object.__float__`. Если метод :meth:`!__float__` не определен, то вызывается метод :meth:`~object.__index__`.
