Repository: MLGRussianXP/python-docs-ru
Catalog: library/functions.po
Languages: ru

source: Infinity
ru: Бесконечность

source: string
ru: строка

source: format() (built-in function)
ru: format() (встроенная функция)

source: file object
ru: файловый объект

source: open() built-in function
ru: встроенная функция open()

source: file
ru: файл

source: modes
ru: режимы

source: universal newlines
ru: универсальные переводы строк

source: line-buffered I/O
ru: ввод/вывод с буферизацией по строкам

source: unbuffered I/O
ru: ввод/вывод без буферизации

source: buffer size, I/O
ru: размер буфера, ввод/вывод

source: I/O control
ru: управление ввода/вывода

source: buffering
ru: буферизация

source: text mode
ru: текстовый режим

source: module
ru: модуль

source: str() (built-in function)
ru: str() (встроенная функция)

source: object
ru: объект

source: statement
ru: инструкция

source: import
ru: импорт

source: builtins
ru: встроенные
