Repository: MLGRussianXP/python-docs-ru
Catalog: library/functions.po
Languages: ru

source: If multiple items are maximal, the function returns the first one encountered. This is consistent with other sort-stability preserving tools such as ``sorted(iterable, key=keyfunc, reverse=True)[0]`` and ``heapq.nlargest(1, iterable, key=keyfunc)``.
ru: Если несколько элементов являются максимальными, функция вернет первый найденный. Это согласуется с другими инструментами, сохраняющими стабильность сортировки, такими как ``sorted(iterable, key=keyfunc, reverse=True)[0]`` и ``heapq.nlargest(1, iterable, key=keyfunc)``.

source: Added the *default* keyword-only parameter.
ru: Добавлен только-именованный параметр *default*.

source: The *key* can be ``None``.
ru: *key* может быть ``None``.

source: Return a "memory view" object created from the given argument. See :ref:`typememoryview` for more information.
ru: Возвращает объект "memory view", созданный из данного аргумента. См. :ref:`typememoryview` для получения дополнительной информации.

source: Return the smallest item in an iterable or the smallest of two or more arguments.
ru: Возвращает наименьший элемент итерируемого объекта или наименьший из двух и более аргументов.

source: If one positional argument is provided, it should be an :term:`iterable`. The smallest item in the iterable is returned. If two or more positional arguments are provided, the smallest of the positional arguments is returned.
ru: Если предоставлен один позиционный аргумент, он должен быть :term:`итерируемым объектом`. Возвращается наименьший элемент в итерируемом объекте. Если предоставлено два или более позиционных аргумента, возвращается наименьший из позиционных аргументов.

source: If multiple items are minimal, the function returns the first one encountered. This is consistent with other sort-stability preserving tools such as ``sorted(iterable, key=keyfunc)[0]`` and ``heapq.nsmallest(1, iterable, key=keyfunc)``.
ru: Если несколько элементов являются минимальными, функция возвращает первый найденный. Это согласуется с другими инструментами, сохраняющими стабильность сортировки, такими как ``sorted(iterable, key=keyfunc)[0]`` и ``heapq.nsmallest(1, iterable, key=keyfunc)``.

source: Retrieve the next item from the :term:`iterator` by calling its :meth:`~iterator.__next__` method. If *default* is given, it is returned if the iterator is exhausted, otherwise :exc:`StopIteration` is raised.
ru: Получает следующий элемент из :term:`итератора`, вызвав его метод :meth:`~iterator.__next__`. Если *default* указан, он возвращается, если итератор исчерпан, в противном случае возбуждается исключение :exc:`StopIteration`.

source: Return a new featureless object. :class:`object` is a base for all classes. It has methods that are common to all instances of Python classes. This function does not accept any arguments.
ru: Возвращает новый объект без фич. :class:`object` является базовым для всех классов. Он имеет методы, которые общие для всех экземпляров классов Python. Эта функция не принимает никаких аргументов.

source: :class:`object` does *not* have a :attr:`~object.__dict__`, so you can't assign arbitrary attributes to an instance of the :class:`object` class.
ru: :class:`object` *не* имеет :attr:`~object.__dict__`, поэтому вы не можете присваивать произвольные атрибуты экземпляру класса :class:`object`.

source: Convert an integer number to an octal string prefixed with "0o". The result is a valid Python expression. If *x* is not a Python :class:`int` object, it has to define an :meth:`~object.__index__` method that returns an integer. For example:
ru: Преобразует целое число в восьмеричную строку с префиксом "0o". Результат является верным выражением Python. Если *x* не является объектом Python класса :class:`int`, он должен определить метод :meth:`~object.__index__`, который возвращает целое число. Например:

source: If you want to convert an integer number to an octal string either with the prefix "0o" or not, you can use either of the following ways.
ru: Если вы хотите преобразовать целое число в восьмеричную строку с префиксом "0o" или без него, вы можете использовать любой из следующих способов.

source: Open *file* and return a corresponding :term:`file object`. If the file cannot be opened, an :exc:`OSError` is raised. See :ref:`tut-files` for more examples of how to use this function.
ru: Открывает *file* и возвращает соответствующий :term:`файловый объект`. Если файл не может быть открыт, возбуждается :exc:`OSError`. См. :ref:`tut-files` для получения дополнительных примеров использования этой функции.

source: *file* is a :term:`path-like object` giving the pathname (absolute or relative to the current working directory) of the file to be opened or an integer file descriptor of the file to be wrapped. (If a file descriptor is given, it is closed when the returned I/O object is closed unless *closefd* is set to ``False``.)
ru: *file* - это :term:`путеподобный объект`, который предоставляет путь (абсолютный или относительный от текущего рабочего каталога) к файлу, который должен быть открыт, или целочисленный файловый дескриптор файла, который должен быть обёрнут. (Если задан файловый дескриптор, он закрывается, когда закрывается возвращаемый объект ввода/вывода, если *closefd* не установлено в ``False``.)

source: *mode* is an optional string that specifies the mode in which the file is opened. It defaults to ``'r'`` which means open for reading in text mode. Other common values are ``'w'`` for writing (truncating the file if it already exists), ``'x'`` for exclusive creation, and ``'a'`` for appending (which on *some* Unix systems, means that *all* writes append to the end of the file regardless of the current seek position). In text mode, if *encoding* is not specified the encoding used is platform-dependent: :func:`locale.getencoding()` is called to get the current locale encoding. (For reading and writing raw bytes use binary mode and leave *encoding* unspecified.) The available modes are:
ru: *mode* - это необязательная строка, которая указывает режим открытия файла. По умолчанию он устанавливается на ``'r'``, что означает открытие файла для чтения в текстовом режиме. Другие распространенные значения: ``'w'`` для записи (если файл уже существует, он будет очищен), ``'x'`` для эксклюзивного создания и ``'a'`` для добавления (что на *некоторых* системах Unix означает, что *все* записи добавляются в конец файла, независимо от текущей позиции чтения). В текстовом режиме, если не указано *encoding*, используется кодировка, зависящая от платформы: вызывается функция :func:`locale.getencoding()` для получения текущей локальной кодировки. (Для чтения и записи сырых байтов используйте двоичный режим и не указывайте *encoding*.) Доступные режимы:

source: Character
ru: Символ

source: Meaning
ru: Значение

source: open for reading (default)
ru: открыть для чтения (по умолчанию)

source: open for writing, truncating the file first
ru: открыть для записи, сначала очистив файл

source: open for exclusive creation, failing if the file already exists
ru: открыть для эксклюзивного создания; неудача, если файл уже существует

source: open for writing, appending to the end of file if it exists
ru: открыть для записи, добавляя в конец файла, если он существует

source: binary mode
ru: бинарный режим

source: text mode (default)
ru: текстовый режим (по умолчанию)

source: open for updating (reading and writing)
ru: открыть для обновления (чтения и записи)

source: The default mode is ``'r'`` (open for reading text, a synonym of ``'rt'``). Modes ``'w+'`` and ``'w+b'`` open and truncate the file. Modes ``'r+'`` and ``'r+b'`` open the file with no truncation.
ru: Режим по умолчанию - ``'r'`` (открытие для чтения текста, синоним ``'rt'``). Режимы ``'w+'`` и ``'w+b'`` открывают и очищают файл. Режимы ``'r+'`` и ``'r+b'`` открывают файл без очистки.

source: As mentioned in the :ref:`io-overview`, Python distinguishes between binary and text I/O. Files opened in binary mode (including ``'b'`` in the *mode* argument) return contents as :class:`bytes` objects without any decoding. In text mode (the default, or when ``'t'`` is included in the *mode* argument), the contents of the file are returned as :class:`str`, the bytes having been first decoded using a platform-dependent encoding or using the specified *encoding* if given.
ru: Как упоминается в :ref:`io-overview`, Python различает два типа ввода-вывода: двоичный и текстовый. Файлы, открытые в двоичном режиме (включая ``'b'`` в аргументе *mode*), возвращают содержимое в виде объектов :class:`bytes` без какой-либо декодировки. В текстовом режиме (по умолчанию или когда в аргументе *mode* указано ``'t'``), содержимое файла возвращается в виде объекта :class:`str`, при этом байты сначала декодируются с использованием кодировки, зависящей от платформы, или с использованием *encoding*, если она указана.

source: Python doesn't depend on the underlying operating system's notion of text files; all the processing is done by Python itself, and is therefore platform-independent.
ru: Python не зависит от базовой операционной системы в понятии текстовых файлов; вся обработка выполняется самим Python и, следовательно, не зависит от платформы.

source: *buffering* is an optional integer used to set the buffering policy. Pass 0 to switch buffering off (only allowed in binary mode), 1 to select line buffering (only usable when writing in text mode), and an integer > 1 to indicate the size in bytes of a fixed-size chunk buffer. Note that specifying a buffer size this way applies for binary buffered I/O, but ``TextIOWrapper`` (i.e., files opened with ``mode='r+'``) would have another buffering. To disable buffering in ``TextIOWrapper``, consider using the ``write_through`` flag for :func:`io.TextIOWrapper.reconfigure`. When no *buffering* argument is given, the default buffering policy works as follows:
ru: *buffering* - это опциональное целое число, используемое для установки политики буферизации. Передайте 0, чтобы отключить буферизацию (разрешено только в двоичном режиме), 1, чтобы выбрать строковую буферизацию (используется только при записи в текстовом режиме), и целое число > 1, чтобы указать размер в байтах буфера порций фиксированного размера. Обратите внимание, что указание размера буфера таким образом применяется для двоичного буферизованного ввода-вывода, но ``TextIOWrapper`` (т.е. файлы, открытые с ``mode='r+'``), будут иметь другую буферизацию. Чтобы отключить буферизацию в ``TextIOWrapper``, рассмотрите возможность использования флага ``write_through`` для :func:`io.TextIOWrapper.reconfigure`. Если аргумент *buffering* не указан, политика буферизации по умолчанию работает следующим образом:

source: Binary files are buffered in fixed-size chunks; the size of the buffer is chosen using a heuristic trying to determine the underlying device's "block size" and falling back on :const:`io.DEFAULT_BUFFER_SIZE`. On many systems, the buffer will typically be 4096 or 8192 bytes long.
ru: Бинарные файлы буферизуются порциями фиксированного размера; размер буфера выбирается с использованием эвристики, пытающейся определить "размер блока" базового устройства и при неудаче прибегающей к значению по умолчанию :const:`io.DEFAULT_BUFFER_SIZE`. На многих системах размер буфера обычно составляет 4096 или 8192 байтов.

source: "Interactive" text files (files for which :meth:`~io.IOBase.isatty` returns ``True``) use line buffering. Other text files use the policy described above for binary files.
ru: "Интерактивные" текстовые файлы (файлы, для которых :meth:`~io.IOBase.isatty` возвращает ``True``) используют буферизацию строк. Другие текстовые файлы используют политику, описанную выше для двоичных файлов.

source: *encoding* is the name of the encoding used to decode or encode the file. This should only be used in text mode. The default encoding is platform dependent (whatever :func:`locale.getencoding` returns), but any :term:`text encoding` supported by Python can be used. See the :mod:`codecs` module for the list of supported encodings.
ru: *encoding* - это имя кодировки, используемой для декодирования или кодирования файла. Это следует использовать только в текстовом режиме. Кодировка по умолчанию зависит от платформы (то, что возвращает функция :func:`locale.getencoding`), но можно использовать любую :term:`кодировку текста`, поддерживаемую Python. См. модуль :mod:`codecs` для списка поддерживаемых кодировок.

source: *errors* is an optional string that specifies how encoding and decoding errors are to be handled—this cannot be used in binary mode. A variety of standard error handlers are available (listed under :ref:`error-handlers`), though any error handling name that has been registered with :func:`codecs.register_error` is also valid. The standard names include:
ru: *errors* - это опциональная строка, которая указывает, как обрабатывать ошибки кодирования и декодирования - её нельзя использовать в двоичном режиме. Доступно множество стандартных обработчиков ошибок (перечисленных в разделе :ref:`error-handlers`), хотя также допустимо использование любого имени обработчика ошибок, зарегистрированного с помощью :func:`codecs.register_error`. Стандартные имена включают:

source: ``'strict'`` to raise a :exc:`ValueError` exception if there is an encoding error. The default value of ``None`` has the same effect.
ru: ``'strict'`` для возбуждения исключения :exc:`ValueError`, если произошла ошибка кодирования. Значение по умолчанию ``None`` имеет тот же эффект.

source: ``'ignore'`` ignores errors. Note that ignoring encoding errors can lead to data loss.
ru: ``'ignore'`` игнорирует ошибки. Обратите внимание, что игнорирование ошибок кодирования может привести к потере данных.

source: ``'replace'`` causes a replacement marker (such as ``'?'``) to be inserted where there is malformed data.
ru: ``'replace'`` заставляет вставить маркер замены (например, ``'?'``) там, где есть некорректные данные.

source: ``'surrogateescape'`` will represent any incorrect bytes as low surrogate code units ranging from U+DC80 to U+DCFF. These surrogate code units will then be turned back into the same bytes when the ``surrogateescape`` error handler is used when writing data. This is useful for processing files in an unknown encoding.
ru: ``'surrogateescape'`` будет представлять любые некорректные байты в виде единиц суррогатного кода, варьирующихся от U+DC80 до U+DCFF. Эти кодовые единицы затем будут преобразованы обратно в те же байты при использовании обработчика ошибок ``surrogateescape`` при записи данных. Это полезно для обработки файлов в неизвестной кодировке.

source: ``'xmlcharrefreplace'`` is only supported when writing to a file. Characters not supported by the encoding are replaced with the appropriate XML character reference :samp:`&#{nnn};`.
ru: ``'xmlcharrefreplace'`` поддерживается только при записи в файл. Символы, не поддерживаемые кодировкой, заменяются соответствующей ссылкой на символ XML :samp:`&#{nnn};`.

source: ``'backslashreplace'`` replaces malformed data by Python's backslashed escape sequences.
ru: ``'backslashreplace'`` заменяет некорректные данные последовательностями экранирования обратной косой черты в Python.

source: ``'namereplace'`` (also only supported when writing) replaces unsupported characters with ``\N{...}`` escape sequences.
ru: ``'namereplace'`` (также поддерживается только при записи) заменяет неподдерживаемые символы на последовательности экранирования ``\N{...}``.

source: *newline* determines how to parse newline characters from the stream. It can be ``None``, ``''``, ``'\n'``, ``'\r'``, and ``'\r\n'``. It works as follows:
ru: *newline* определяет, как анализировать символы новой строки из потока. Он может быть ``None``, ``''``, ``'\n'``, ``'\r'`` и ``'\r\n'``. Он работает следующим образом:

source: When reading input from the stream, if *newline* is ``None``, universal newlines mode is enabled. Lines in the input can end in ``'\n'``, ``'\r'``, or ``'\r\n'``, and these are translated into ``'\n'`` before being returned to the caller. If it is ``''``, universal newlines mode is enabled, but line endings are returned to the caller untranslated. If it has any of the other legal values, input lines are only terminated by the given string, and the line ending is returned to the caller untranslated.
ru: При чтении ввода из потока, если *newline* равно ``None``, включен режим универсальных переводов строк. Строки во вводе могут заканчиваться на ``'\n'``, ``'\r'`` или ``'\r\n'``, и они переводятся в ``'\n'`` перед возвратом вызывающей стороне. Если *newline* равно ``''``, включен режим универсальных переводов строк, но концы строк возвращаются вызывающей стороне без изменений. Если *newline* имеет любое другое допустимое значение, строки ввода завершаются только заданной строкой, и конец строки возвращается вызывающей стороне без изменений.

source: When writing output to the stream, if *newline* is ``None``, any ``'\n'`` characters written are translated to the system default line separator, :data:`os.linesep`. If *newline* is ``''`` or ``'\n'``, no translation takes place. If *newline* is any of the other legal values, any ``'\n'`` characters written are translated to the given string.
ru: При записи вывода в поток, если *newline* равно ``None``, все символы ``'\n'``, записанные, будут преобразованы в системный разделитель строк по умолчанию, :data:`os.linesep`. Если *newline* равно ``''`` или ``'\n'``, преобразование не выполняется. Если *newline* равно любому другому допустимому значению, все записанные символы ``'\n'`` будут преобразованы в заданную строку.

source: If *closefd* is ``False`` and a file descriptor rather than a filename was given, the underlying file descriptor will be kept open when the file is closed. If a filename is given *closefd* must be ``True`` (the default); otherwise, an error will be raised.
ru: Если *closefd* равно ``False`` и вместо имени файла был передан файловый дескриптор, базовый файловый дескриптор будет оставлен открытым при закрытии файла. Если указано имя файла, *closefd* должно быть равно ``True`` (значение по умолчанию); в противном случае будет возбуждена ошибка.

source: A custom opener can be used by passing a callable as *opener*. The underlying file descriptor for the file object is then obtained by calling *opener* with (*file*, *flags*). *opener* must return an open file descriptor (passing :mod:`os.open` as *opener* results in functionality similar to passing ``None``).
ru: Пользовательский открыватель может быть использован путем передачи вызываемого объекта в качестве *opener*. Затем базовый файловый дескриптор для объекта файла получается путем вызова *opener* с (*file*, *flags*). *opener* должен вернуть открытый файловый дескриптор (передача :mod:`os.open` в качестве *opener* приводит к функциональности, аналогичной передаче ``None``).

source: The newly created file is :ref:`non-inheritable <fd_inheritance>`.
ru: Новый созданный файл - это :ref:`non-inheritable <fd_inheritance>`.

source: The following example uses the :ref:`dir_fd <dir_fd>` parameter of the :func:`os.open` function to open a file relative to a given directory::
ru: Следующий пример использует параметр :ref:`dir_fd <dir_fd>` функции :func:`os.open` для открытия файла относительно заданного каталога::

source: The type of :term:`file object` returned by the :func:`open` function depends on the mode. When :func:`open` is used to open a file in a text mode (``'w'``, ``'r'``, ``'wt'``, ``'rt'``, etc.), it returns a subclass of :class:`io.TextIOBase` (specifically :class:`io.TextIOWrapper`). When used to open a file in a binary mode with buffering, the returned class is a subclass of :class:`io.BufferedIOBase`. The exact class varies: in read binary mode, it returns an :class:`io.BufferedReader`; in write binary and append binary modes, it returns an :class:`io.BufferedWriter`, and in read/write mode, it returns an :class:`io.BufferedRandom`. When buffering is disabled, the raw stream, a subclass of :class:`io.RawIOBase`, :class:`io.FileIO`, is returned.
ru: Тип :term:`файлового объекта`, возвращаемого функцией :func:`open`, зависит от режима. При использовании :func:`open` для открытия файла в текстовом режиме (``'w'``, ``'r'``, ``'wt'``, ``'rt'``, и т.д.), возвращается подкласс :class:`io.TextIOBase` (точнее :class:`io.TextIOWrapper`). При использовании для открытия файла в бинарном режиме с буферизацией, возвращаемый класс является подклассом :class:`io.BufferedIOBase`. Точный класс может варьироваться: в режиме чтения бинарного файла возвращается :class:`io.BufferedReader`; в режимах записи бинарного и добавления бинарного возвращается :class:`io.BufferedWriter`, а в режиме чтения/записи возвращается :class:`io.BufferedRandom`. При отключении буферизации возвращается необработанный поток, подкласс :class:`io.RawIOBase`, :class:`io.FileIO`.

source: See also the file handling modules, such as :mod:`fileinput`, :mod:`io` (where :func:`open` is declared), :mod:`os`, :mod:`os.path`, :mod:`tempfile`, and :mod:`shutil`.
ru: См. также модули обработки файлов, такие как :mod:`fileinput`, :mod:`io` (где объявлена функция :func:`open`), :mod:`os`, :mod:`os.path`, :mod:`tempfile` и :mod:`shutil`.

source: Raises an :ref:`auditing event <auditing>` ``open`` with arguments ``file``, ``mode``, ``flags``.
ru: Возбуждает :ref:`событие аудита <auditing>` с аргументами ``file``, ``mode``, ``flags``.

source: The ``mode`` and ``flags`` arguments may have been modified or inferred from the original call.
ru: Аргументы ``mode`` и ``flags`` могут быть изменены или выведены из оригинального вызова.

source: The *opener* parameter was added.
ru: Параметр *opener* был добавлен.

source: The ``'x'`` mode was added.
ru: Режим ``'x'`` был добавлен.

source: :exc:`IOError` used to be raised, it is now an alias of :exc:`OSError`.
ru: :exc:`IOError` раньше использовался для возбуждения, теперь это псевдоним :exc:`OSError`.

source: :exc:`FileExistsError` is now raised if the file opened in exclusive creation mode (``'x'``) already exists.
ru: :exc:`FileExistsError` теперь возбуждается, если файл, открытый в эксклюзивном режиме создания (``'x'``), уже существует.

source: The file is now non-inheritable.
ru: Файл теперь не наследуется.

source: If the system call is interrupted and the signal handler does not raise an exception, the function now retries the system call instead of raising an :exc:`InterruptedError` exception (see :pep:`475` for the rationale).
ru: Если системный вызов прерывается и обработчик сигнала не возбуждает исключение, функция теперь повторяет системный вызов вместо возбуждения исключения :exc:`InterruptedError` (см. :pep:`475` для объяснения).

source: The ``'namereplace'`` error handler was added.
ru: Обработчик ошибок ``'namereplace'`` был добавлен.

source: Support added to accept objects implementing :class:`os.PathLike`.
ru: Добавлена поддержка для принятия объектов, реализующих :class:`os.PathLike`.

source: On Windows, opening a console buffer may return a subclass of :class:`io.RawIOBase` other than :class:`io.FileIO`.
ru: На Windows открытие буфера консоли может вернуть подкласс :class:`io.RawIOBase`, отличный от :class:`io.FileIO`.

source: The ``'U'`` mode has been removed.
ru: Режим ``'U'`` был удален.

source: Given a string representing one Unicode character, return an integer representing the Unicode code point of that character. For example, ``ord('a')`` returns the integer ``97`` and ``ord('€')`` (Euro sign) returns ``8364``. This is the inverse of :func:`chr`.
ru: Даётся строка, представляющая один символ Юникода, возвращается целое число, представляющее кодовую позицию Юникода этого символа. Например, ``ord('a')`` возвращает целое число ``97``, а ``ord('€')`` (знак евро) возвращает ``8364``. Это обратное действие к :func:`chr`.
