Repository: MLGRussianXP/python-docs-ru
Catalog: library/functions.po
Languages: ru

source: For some use cases, there are good alternatives to :func:`sum`. The preferred, fast way to concatenate a sequence of strings is by calling ``''.join(sequence)``. To add floating point values with extended precision, see :func:`math.fsum`\. To concatenate a series of iterables, consider using :func:`itertools.chain`.
ru: Для некоторых случаев использования существуют хорошие альтернативы для :func:`sum`. Предпочтительный и быстрый способ конкатенации последовательности строк - вызов ``''.join(sequence)``. Для сложения чисел с плавающей точкой с расширенной точностью см. :func:`math.fsum`\. Для конкатенации серии итерируемых объектов рассмотрите использование :func:`itertools.chain`.

source: The *start* parameter can be specified as a keyword argument.
ru: Параметр *start* может быть указан как именованный аргумент.

source: Summation of floats switched to an algorithm that gives higher accuracy on most builds.
ru: Суммирование чисел с плавающей запятой заменено на алгоритм, который обеспечивает более высокую точность в большинстве сборок.

source: Return a proxy object that delegates method calls to a parent or sibling class of *type*. This is useful for accessing inherited methods that have been overridden in a class.
ru: Возвращает объект-прокси, который делегирует вызовы методов родительскому или смежному классу *type*. Это полезно для доступа к унаследованным методам, которые были переопределены в классе.

source: The *object_or_type* determines the :term:`method resolution order` to be searched. The search starts from the class right after the *type*.
ru: *object_or_type* определяет :term:`порядок разрешения методов`, который будет искаться. Поиск начинается с класса, следующего сразу после *type*.

source: For example, if :attr:`~class.__mro__` of *object_or_type* is ``D -> B -> C -> A -> object`` and the value of *type* is ``B``, then :func:`super` searches ``C -> A -> object``.
ru: Например, если :attr:`~class.__mro__` *object_or_type* это ``D -> B -> C -> A -> object`` и значение *type* это ``B``, тогда :func:`super` ищет ``C -> A -> object``.

source: The :attr:`~class.__mro__` attribute of the *object_or_type* lists the method resolution search order used by both :func:`getattr` and :func:`super`. The attribute is dynamic and can change whenever the inheritance hierarchy is updated.
ru: Атрибут :attr:`~class.__mro__` *object_or_type* перечисляет порядок поиска разрешения методов, используемый как :func:`getattr`, так и :func:`super`. Атрибут является динамическим и может изменяться при обновлении иерархии наследования.

source: If the second argument is omitted, the super object returned is unbound. If the second argument is an object, ``isinstance(obj, type)`` must be true. If the second argument is a type, ``issubclass(type2, type)`` must be true (this is useful for classmethods).
ru: Если второй аргумент опущен, возвращаемый объект супер является непривязанным. Если второй аргумент является объектом, ``isinstance(obj, type)`` должно быть истиной. Если второй аргумент является типом, ``issubclass(type2, type)`` должно быть истиной (это полезно для классовых методов).

source: There are two typical use cases for *super*. In a class hierarchy with single inheritance, *super* can be used to refer to parent classes without naming them explicitly, thus making the code more maintainable. This use closely parallels the use of *super* in other programming languages.
ru: Есть два типичных случая использования *super*. В иерархии классов с одиночным наследованием *super* может использоваться для ссылки на родительские классы без явного указания их имен, что делает код более поддерживаемым. Это использование тесно соответствует использованию *super* в других языках программирования.

source: The second use case is to support cooperative multiple inheritance in a dynamic execution environment. This use case is unique to Python and is not found in statically compiled languages or languages that only support single inheritance. This makes it possible to implement "diamond diagrams" where multiple base classes implement the same method. Good design dictates that such implementations have the same calling signature in every case (because the order of calls is determined at runtime, because that order adapts to changes in the class hierarchy, and because that order can include sibling classes that are unknown prior to runtime).
ru: Второй сценарий использования - поддержка совместного множественного наследования в динамической среде выполнения. Этот сценарий использования уникален для Python и не встречается в статически компилируемых языках или языках, которые поддерживают только одиночное наследование. Это позволяет реализовывать "алмазные диаграммы", где несколько базовых классов реализуют один и тот же метод. Хороший дизайн предписывает, чтобы такие реализации имели одинаковую подпись вызова в каждом случае (потому что порядок вызовов определяется во время выполнения, потому что этот порядок адаптируется к изменениям в иерархии классов и потому что этот порядок может включать дочерние классы, которые неизвестны до времени выполнения).

source: For both use cases, a typical superclass call looks like this::
ru: Для обоих случаев использования типичный вызов суперкласса выглядит так::

source: In addition to method lookups, :func:`super` also works for attribute lookups. One possible use case for this is calling :term:`descriptors <descriptor>` in a parent or sibling class.
ru: В дополнение к поиску методов, :func:`super` также работает для поиска атрибутов. Один из возможных случаев использования - вызов :term:`дескрипторов <descriptor>` в родительском или дочернем классе.

source: Note that :func:`super` is implemented as part of the binding process for explicit dotted attribute lookups such as ``super().__getitem__(name)``. It does so by implementing its own :meth:`~object.__getattribute__` method for searching classes in a predictable order that supports cooperative multiple inheritance. Accordingly, :func:`super` is undefined for implicit lookups using statements or operators such as ``super()[name]``.
ru: Обратите внимание, что :func:`super` реализована как часть процесса связывания для поисков явных точечных атрибутов, таких как ``super().__getitem__(name)``. Она делает это, реализуя собственный метод :meth:`~object.__getattribute__` для поиска классов в предсказуемом порядке, который поддерживает кооперативное множественное наследование. Следовательно, :func:`super` не определена для неявных поисков с использованием инструкций или операторов, таких как ``super()[name]``.

source: Also note that, aside from the zero argument form, :func:`super` is not limited to use inside methods. The two argument form specifies the arguments exactly and makes the appropriate references. The zero argument form only works inside a class definition, as the compiler fills in the necessary details to correctly retrieve the class being defined, as well as accessing the current instance for ordinary methods.
ru: Также обратите внимание, что помимо формы без аргументов, :func:`super` не ограничивается использованием внутренних методов. Форма с двумя аргументами указывает аргументы точно и делает соответствующие ссылки. Форма без аргументов работает только внутри определения класса, так как компилятор заполняет необходимые детали для правильного получения определяемого класса, а также доступа к текущему экземпляру для обычных методов.

source: For practical suggestions on how to design cooperative classes using :func:`super`, see `guide to using super() <https://rhettinger.wordpress.com/2011/05/26/super-considered-super/>`_.
ru: Для практических рекомендаций по проектированию кооперативных классов с использованием :func:`super`, см. `руководство по использованию super() <https://rhettinger.wordpress.com/2011/05/26/super-considered-super/>`_.

source: Rather than being a function, :class:`tuple` is actually an immutable sequence type, as documented in :ref:`typesseq-tuple` and :ref:`typesseq`.
ru: Вместо того чтобы быть функцией, :class:`tuple` на самом деле является неизменяемым типом последовательности, как документировано в :ref:`typesseq-tuple` и :ref:`typesseq`.

source: With one argument, return the type of an *object*. The return value is a type object and generally the same object as returned by :attr:`object.__class__ <instance.__class__>`.
ru: С одним аргументом возвращает тип *object*. Возвращаемое значение - это объект типа и, как правило, тот же объект, который возвращается :attr:`object.__class__ <instance.__class__>`.

source: The :func:`isinstance` built-in function is recommended for testing the type of an object, because it takes subclasses into account.
ru: Встроенная функция :func:`isinstance` рекомендуется для проверки типа объекта, так как она учитывает подклассы.

source: With three arguments, return a new type object. This is essentially a dynamic form of the :keyword:`class` statement. The *name* string is the class name and becomes the :attr:`~definition.__name__` attribute. The *bases* tuple contains the base classes and becomes the :attr:`~class.__bases__` attribute; if empty, :class:`object`, the ultimate base of all classes, is added. The *dict* dictionary contains attribute and method definitions for the class body; it may be copied or wrapped before becoming the :attr:`~object.__dict__` attribute. The following two statements create identical :class:`type` objects:
ru: С тремя аргументами возвращает новый объект типа. По сути, это динамическая форма инструкции :keyword:`class`. Строка *name* является именем класса и становится атрибутом :attr:`~definition.__name__`. Кортеж *bases* содержит базовые классы и становится атрибутом :attr:`~class.__bases__`; если пустой, добавляется :class:`object`, конечный базовый класс всех классов. Словарь *dict* содержит определения атрибутов и методов для тела класса; он может быть скопирован или обёрнут перед тем, как стать атрибутом :attr:`~object.__dict__`. Следующие две инструкции создают идентичные объекты :class:`type`:

source: See also :ref:`bltin-type-objects`.
ru: См. также :ref:`bltin-type-objects`.

source: Keyword arguments provided to the three argument form are passed to the appropriate metaclass machinery (usually :meth:`~object.__init_subclass__`) in the same way that keywords in a class definition (besides *metaclass*) would.
ru: Именованные аргументы, предоставленные для трехаргументной формы, передаются соответствующему механизму метакласса (обычно :meth:`~object.__init_subclass__`) таким же образом, как ключевые слова в определении класса (кроме *metaclass*).

source: See also :ref:`class-customization`.
ru: См. также :ref:`class-customization`.

source: Subclasses of :class:`type` which don't override ``type.__new__`` may no longer use the one-argument form to get the type of an object.
ru: Подклассы :class:`type`, которые не переопределяют ``type.__new__``, больше не могут использовать форму с одним аргументом для получения типа объекта.

source: Return the :attr:`~object.__dict__` attribute for a module, class, instance, or any other object with a :attr:`~object.__dict__` attribute.
ru: Возвращает атрибут :attr:`~object.__dict__` для модуля, класса, экземпляра или любого другого объекта с атрибутом :attr:`~object.__dict__`.

source: Objects such as modules and instances have an updateable :attr:`~object.__dict__` attribute; however, other objects may have write restrictions on their :attr:`~object.__dict__` attributes (for example, classes use a :class:`types.MappingProxyType` to prevent direct dictionary updates).
ru: Объекты, такие как модули и экземпляры, имеют обновляемый атрибут :attr:`~object.__dict__`; однако, у других объектов может быть ограничение на запись их атрибутов :attr:`~object.__dict__` (например, классы используют :class:`types.MappingProxyType` для предотвращения прямых обновлений словаря).

source: Without an argument, :func:`vars` acts like :func:`locals`. Note, the locals dictionary is only useful for reads since updates to the locals dictionary are ignored.
ru: Без аргумента, :func:`vars` действует как :func:`locals`. Обратите внимание, что словарь *locals* полезен только для чтения, поскольку обновления словаря *locals* игнорируются.

source: A :exc:`TypeError` exception is raised if an object is specified but it doesn't have a :attr:`~object.__dict__` attribute (for example, if its class defines the :attr:`~object.__slots__` attribute).
ru: Возбуждается исключение :exc:`TypeError`, если указан объект, но у него нет атрибута :attr:`~object.__dict__` (например, если его класс определяет атрибут :attr:`~object.__slots__`).

source: Iterate over several iterables in parallel, producing tuples with an item from each one.
ru: Итерируется по нескольким итерируемым объектам параллельно, создавая кортежи с элементом из каждого из них.

source: Example::
ru: Пример::

source: More formally: :func:`zip` returns an iterator of tuples, where the *i*-th tuple contains the *i*-th element from each of the argument iterables.
ru: Более формально: :func:`zip` возвращает итератор кортежей, где *i*-й кортеж содержит *i*-й элемент из каждого из аргументов итерируемых объектов

source: Another way to think of :func:`zip` is that it turns rows into columns, and columns into rows. This is similar to `transposing a matrix <https://en.wikipedia.org/wiki/Transpose>`_.
ru: Другой способ представить :func:`zip` заключается в том, что он превращает строки в столбцы и столбцы в строки. Это похоже на `транспонирование матрицы <https://ru.wikipedia.org/wiki/%D0%A2%D1%80%D0%B0%D0%BD%D1%81%D0%BF%D0%BE%D0%BD%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%BD%D0%B0%D1%8F_%D0%BC%D0%B0%D1%82%D1%80%D0%B8%D1%86%D0%B0>`_.

source: :func:`zip` is lazy: The elements won't be processed until the iterable is iterated on, e.g. by a :keyword:`!for` loop or by wrapping in a :class:`list`.
ru: :func:`zip` ленивый: Элементы не будут обрабатываться, пока не будет выполнено итерирование по итерируемому объекту, например, с помощью цикла :keyword:`!for` или обертки в :class:`list`.

source: One thing to consider is that the iterables passed to :func:`zip` could have different lengths; sometimes by design, and sometimes because of a bug in the code that prepared these iterables. Python offers three different approaches to dealing with this issue:
ru: Одна вещь, которую следует учесть, заключается в том, что итерируемые объекты, передаваемые в :func:`zip`, могут иметь разную длину; иногда это сделано намеренно, а иногда из-за ошибки в коде, который подготовил эти итерируемые объекты. Python предлагает три разных подхода к решению этой проблемы.

source: By default, :func:`zip` stops when the shortest iterable is exhausted. It will ignore the remaining items in the longer iterables, cutting off the result to the length of the shortest iterable::
ru: По умолчанию, :func:`zip` останавливается, когда исчерпывается самый короткий итерируемый объект. Он игнорирует оставшиеся элементы в более длинных итерируемых объектах, обрезая результат до длины самого короткого итерируемого объекта::

source: :func:`zip` is often used in cases where the iterables are assumed to be of equal length. In such cases, it's recommended to use the ``strict=True`` option. Its output is the same as regular :func:`zip`::
ru: :func:`zip` часто используется в случаях, когда предполагается, что итерируемые объекты имеют одинаковую длину. В таких случаях рекомендуется использовать опцию ``strict=True``. Его вывод аналогичен обычному :func:`zip`::

source: Unlike the default behavior, it raises a :exc:`ValueError` if one iterable is exhausted before the others:
ru: В отличие от поведения по умолчанию, оно возбуждает :exc:`ValueError`, если один итерируемый объект исчерпывается раньше других.

source: Without the ``strict=True`` argument, any bug that results in iterables of different lengths will be silenced, possibly manifesting as a hard-to-find bug in another part of the program.
ru: Без аргумента ``strict=True``, любая ошибка, приводящая к итерируемым объектам разной длины, будет подавлена, что может проявиться как труднонаходимая ошибка в другой части программы.

source: Shorter iterables can be padded with a constant value to make all the iterables have the same length. This is done by :func:`itertools.zip_longest`.
ru: Более короткие итерируемые объекты могут быть заполнены постоянным значением, чтобы все итерируемые объекты имели одинаковую длину. Это делается с помощью :func:`itertools.zip_longest`.

source: Edge cases: With a single iterable argument, :func:`zip` returns an iterator of 1-tuples. With no arguments, it returns an empty iterator.
ru: Крайние случаи: С одним итерируемым аргументом, :func:`zip` возвращает итератор из 1-кортежей. Без аргументов возвращает пустой итератор.

source: Tips and tricks:
ru: Советы и хитрости:

source: The left-to-right evaluation order of the iterables is guaranteed. This makes possible an idiom for clustering a data series into n-length groups using ``zip(*[iter(s)]*n, strict=True)``. This repeats the *same* iterator ``n`` times so that each output tuple has the result of ``n`` calls to the iterator. This has the effect of dividing the input into n-length chunks.
ru: Порядок вычисления итерируемых объектов слева направо гарантирован. Это позволяет использовать идиому для кластеризации серии данных в группы длиной n с использованием ``zip(*[iter(s)]*n, strict=True)``. Это повторяет *тот же* итератор ``n`` раз, чтобы каждый выходной кортеж содержал результат ``n`` вызовов итератора. Это приводит к разделению входных данных на части длиной n.

source: :func:`zip` in conjunction with the ``*`` operator can be used to unzip a list::
ru: :func:`zip` в сочетании с оператором ``*`` можно использовать для разархивации списка::

source: Added the ``strict`` argument.
ru: Добавлен аргумент ``strict``.

source: This is an advanced function that is not needed in everyday Python programming, unlike :func:`importlib.import_module`.
ru: Это продвинутая функция, которая не нужна в повседневном программировании на Python, в отличие от :func:`importlib.import_module`.

source: This function is invoked by the :keyword:`import` statement. It can be replaced (by importing the :mod:`builtins` module and assigning to ``builtins.__import__``) in order to change semantics of the :keyword:`!import` statement, but doing so is **strongly** discouraged as it is usually simpler to use import hooks (see :pep:`302`) to attain the same goals and does not cause issues with code which assumes the default import implementation is in use. Direct use of :func:`__import__` is also discouraged in favor of :func:`importlib.import_module`.
ru: Эта функция вызывается инструкцией :keyword:`import`. Ее можно заменить (импортировав модуль :mod:`builtins` и присвоив ``builtins.__import__``) для изменения семантики инструкции :keyword:`!import`, но это **настоятельно** не рекомендуется, так как обычно проще использовать хуки импорта (см. :pep:`302`) для достижения тех же целей, и это не вызывает проблем с кодом, который предполагает использование реализации импорта по умолчанию. Прямое использование :func:`__import__` также не рекомендуется в пользу функции :func:`importlib.import_module`.

source: The function imports the module *name*, potentially using the given *globals* and *locals* to determine how to interpret the name in a package context. The *fromlist* gives the names of objects or submodules that should be imported from the module given by *name*. The standard implementation does not use its *locals* argument at all and uses its *globals* only to determine the package context of the :keyword:`import` statement.
ru: Функция импортирует модуль *name*, потенциально используя заданные *globals* и *locals* для определения того, как интерпретировать имя в контексте пакета. *fromlist* содержит имена объектов или подмодулей, которые должны быть импортированы из модуля, заданного *name*. Стандартная реализация вообще не использует аргумент *locals* и использует аргумент *globals* только для определения контекста пакета инструкции :keyword:`import`.

source: *level* specifies whether to use absolute or relative imports. ``0`` (the default) means only perform absolute imports. Positive values for *level* indicate the number of parent directories to search relative to the directory of the module calling :func:`__import__` (see :pep:`328` for the details).
ru: *level* указывает, следует ли использовать абсолютные или относительные импорты. ``0`` (значение по умолчанию) означает, что выполняются только абсолютные импорты. Положительные значения для *level* указывают количество родительских каталогов для поиска относительно каталога модуля, вызывающего :func:`__import__` (см. :pep:`328` для подробностей).

source: When the *name* variable is of the form ``package.module``, normally, the top-level package (the name up till the first dot) is returned, *not* the module named by *name*. However, when a non-empty *fromlist* argument is given, the module named by *name* is returned.
ru: Когда переменная *name* имеет форму ``package.module``, обычно возвращается пакет верхнего уровня (имя до первой точки), а не модуль, указанный в *name*. Однако, если указан аргумент *fromlist*, содержащий не пустое значение, возвращается модуль, указанный в *name*.

source: For example, the statement ``import spam`` results in bytecode resembling the following code::
ru: Например, инструкция ``import spam`` приводит к байт-коду, похожему на следующий код::

source: The statement ``import spam.ham`` results in this call::
ru: Инструкция ``import spam.ham`` приводит к такому вызову::

source: Note how :func:`__import__` returns the toplevel module here because this is the object that is bound to a name by the :keyword:`import` statement.
ru: Обратите внимание, как :func:`__import__` возвращает модуль верхнего уровня, потому что это объект, который связан с именем с помощью инструкции :keyword:`import`.

source: On the other hand, the statement ``from spam.ham import eggs, sausage as saus`` results in ::
ru: С другой стороны, инструкция ``from spam.ham import eggs, sausage as saus`` приводит к ::

source: Here, the ``spam.ham`` module is returned from :func:`__import__`. From this object, the names to import are retrieved and assigned to their respective names.
ru: Здесь модуль ``spam.ham`` возвращается из :func:`__import__`. Из этого объекта извлекаются и присваиваются имена для импорта их соответствующим именам.

source: If you simply want to import a module (potentially within a package) by name, use :func:`importlib.import_module`.
ru: Если вы просто хотите импортировать модуль (возможно, внутри пакета) по имени, используйте :func:`importlib.import_module`.

source: Negative values for *level* are no longer supported (which also changes the default value to 0).
ru: Отрицательные значения для *level* больше не поддерживаются (что также изменяет значение по умолчанию на 0).

source: When the command line options :option:`-E` or :option:`-I` are being used, the environment variable :envvar:`PYTHONCASEOK` is now ignored.
ru: Когда используются опции командной строки :option:`-E` или :option:`-I`, переменная окружения :envvar:`PYTHONCASEOK` теперь игнорируется.

source: Footnotes
ru: Сноски

source: Note that the parser only accepts the Unix-style end of line convention. If you are reading the code from a file, make sure to use newline conversion mode to convert Windows or Mac-style newlines.
ru: Обратите внимание, что парсер принимает только соглашение о конце строки в стиле Unix. Если вы считываете код из файла, убедитесь, что используете режим преобразования перевода строки для преобразования переводов строки в стиле Windows или Mac.

source: Boolean
ru: Логический тип

source: type
ru: тип

source: built-in function
ru: встроенная функция
