Repository: MLGRussianXP/python-docs-ru
Catalog: library/functions.po
Languages: ru

source: When converting from a string, the string must not contain whitespace around the central ``+`` or ``-`` operator. For example, ``complex('1+2j')`` is fine, but ``complex('1 + 2j')`` raises :exc:`ValueError`.
ru: При преобразовании из строки, строка не должна содержать пробелы вокруг центрального оператора ``+`` или ``-``. Например, ``complex('1+2j')`` допустимо, но ``complex('1 + 2j')`` возбуждает исключение :exc:`ValueError`.

source: The complex type is described in :ref:`typesnumeric`.
ru: Описание сложного типа приведено в :ref:`typesnumeric`.

source: Grouping digits with underscores as in code literals is allowed.
ru: Группировка цифр с использованием подчеркивания, как в коде литералов, разрешена.

source: Falls back to :meth:`~object.__index__` if :meth:`~object.__complex__` and :meth:`~object.__float__` are not defined.
ru: Возвращается к :meth:`~object.__index__`, если :meth:`~object.__complex__` и :meth:`~object.__float__` не определены.

source: This is a relative of :func:`setattr`. The arguments are an object and a string. The string must be the name of one of the object's attributes. The function deletes the named attribute, provided the object allows it. For example, ``delattr(x, 'foobar')`` is equivalent to ``del x.foobar``. *name* need not be a Python identifier (see :func:`setattr`).
ru: Это родственник функции :func:`setattr`. Аргументы - это объект и строка. Строка должна быть именем одного из атрибутов объекта. Функция удаляет указанный атрибут, если объект позволяет это. Например, ``delattr(x, 'foobar')`` эквивалентно ``del x.foobar``. *name* не обязательно должно быть идентификатором Python (см. :func:`setattr`).

source: Create a new dictionary. The :class:`dict` object is the dictionary class. See :class:`dict` and :ref:`typesmapping` for documentation about this class.
ru: Создаёт новый словарь. Объект :class:`dict` является классом словаря. См. :class:`dict` и :ref:`typesmapping` для документации об этом классе.

source: For other containers see the built-in :class:`list`, :class:`set`, and :class:`tuple` classes, as well as the :mod:`collections` module.
ru: Для других контейнеров см. встроенные классы :class:`list`, :class:`set` и :class:`tuple`, а также модуль :mod:`collections`.

source: Without arguments, return the list of names in the current local scope. With an argument, attempt to return a list of valid attributes for that object.
ru: Без аргументов возвращает список имен в текущей локальной области видимости. С аргументом попытается вернуть список допустимых атрибутов для этого объекта.

source: If the object has a method named :meth:`~object.__dir__`, this method will be called and must return the list of attributes. This allows objects that implement a custom :func:`~object.__getattr__` or :func:`~object.__getattribute__` function to customize the way :func:`dir` reports their attributes.
ru: Если объект имеет метод с именем :meth:`~object.__dir__`, этот метод будет вызван и должен вернуть список атрибутов. Это позволяет объектам, которые реализуют пользовательские функции :func:`~object.__getattr__` или :func:`~object.__getattribute__`, настраивать способ отображения их атрибутов в функции :func:`dir`.

source: If the object does not provide :meth:`~object.__dir__`, the function tries its best to gather information from the object's :attr:`~object.__dict__` attribute, if defined, and from its type object. The resulting list is not necessarily complete and may be inaccurate when the object has a custom :func:`~object.__getattr__`.
ru: Если объект не предоставляет :meth:`~object.__dir__`, функция пытается собрать информацию из атрибута :attr:`~object.__dict__` объекта, если он определен, и из его типа объекта. Полученный список не обязательно является полным и может быть неточным, когда у объекта есть пользовательская :func:`~object.__getattr__`.

source: The default :func:`dir` mechanism behaves differently with different types of objects, as it attempts to produce the most relevant, rather than complete, information:
ru: Стандартный механизм :func:`dir` ведет себя по-разному с различными типами объектов, поскольку он пытается предоставить наиболее актуальную, а не полную информацию:

source: If the object is a module object, the list contains the names of the module's attributes.
ru: Если объект является объектом модуля, список содержит имена атрибутов модуля.

source: If the object is a type or class object, the list contains the names of its attributes, and recursively of the attributes of its bases.
ru: Если объект является объектом типа или класса, список содержит имена его атрибутов и рекурсивно атрибуты его базовых классов.

source: Otherwise, the list contains the object's attributes' names, the names of its class's attributes, and recursively of the attributes of its class's base classes.
ru: В противном случае, список содержит имена атрибутов объекта, имена атрибутов его класса и рекурсивно атрибуты базовых классов его класса.

source: The resulting list is sorted alphabetically. For example:
ru: Результирующий список отсортирован в алфавитном порядке. Например:

source: Because :func:`dir` is supplied primarily as a convenience for use at an interactive prompt, it tries to supply an interesting set of names more than it tries to supply a rigorously or consistently defined set of names, and its detailed behavior may change across releases. For example, metaclass attributes are not in the result list when the argument is a class.
ru: Так как :func:`dir` предоставляется в основном для удобства использования в интерактивном режиме, он пытается предоставить интересный набор имен, скорее чем строго или последовательно определенный набор имен, и его подробное поведение может меняться в разных версиях. Например, атрибуты метакласса не включены в список результатов, когда аргументом является класс.

source: Take two (non-complex) numbers as arguments and return a pair of numbers consisting of their quotient and remainder when using integer division. With mixed operand types, the rules for binary arithmetic operators apply. For integers, the result is the same as ``(a // b, a % b)``. For floating point numbers the result is ``(q, a % b)``, where *q* is usually ``math.floor(a / b)`` but may be 1 less than that. In any case ``q * b + a % b`` is very close to *a*, if ``a % b`` is non-zero it has the same sign as *b*, and ``0 <= abs(a % b) < abs(b)``.
ru: Принимает два (не комплексных) числа в качестве аргументов и возвращает пару чисел, состоящую из их частного и остатка при использовании целочисленного деления. При смешанных типах операндов применяются правила для бинарных арифметических операторов. Для целых чисел результат такой же, как ``(a // b, a % b)``. Для чисел с плавающей запятой результат такой: ``(q, a % b)``, где *q* обычно равно ``math.floor(a / b)``, но может быть на 1 меньше. В любом случае ``q * b + a % b`` очень близко к *a*, если ``a % b`` не равно нулю, оно имеет тот же знак, что и *b*, и ``0 <= abs(a % b) < abs(b)``.

source: Return an enumerate object. *iterable* must be a sequence, an :term:`iterator`, or some other object which supports iteration. The :meth:`~iterator.__next__` method of the iterator returned by :func:`enumerate` returns a tuple containing a count (from *start* which defaults to 0) and the values obtained from iterating over *iterable*.
ru: Возвращает объект перечисления. *iterable* должен быть последовательностью, :term:`итератором` или другим объектом, поддерживающим итерацию. Метод :meth:`~iterator.__next__` итератора, возвращаемого функцией :func:`enumerate`, возвращает кортеж, содержащий счетчик (начиная с *start*, по умолчанию 0) и значения, полученные при итерации по *iterable*.

source: Equivalent to::
ru: Эквивалентно::

source: The arguments are a string and optional globals and locals. If provided, *globals* must be a dictionary. If provided, *locals* can be any mapping object.
ru: Аргументы - это строка и необязательные глобальные и локальные переменные. Если предоставлено, *globals* должен быть словарем. Если предоставлено, *locals* может быть любым объектом сопоставления.

source: The *expression* argument is parsed and evaluated as a Python expression (technically speaking, a condition list) using the *globals* and *locals* dictionaries as global and local namespace. If the *globals* dictionary is present and does not contain a value for the key ``__builtins__``, a reference to the dictionary of the built-in module :mod:`builtins` is inserted under that key before *expression* is parsed. That way you can control what builtins are available to the executed code by inserting your own ``__builtins__`` dictionary into *globals* before passing it to :func:`eval`. If the *locals* dictionary is omitted it defaults to the *globals* dictionary. If both dictionaries are omitted, the expression is executed with the *globals* and *locals* in the environment where :func:`eval` is called. Note, *eval()* does not have access to the :term:`nested scopes <nested scope>` (non-locals) in the enclosing environment.
ru: Аргумент *выражение* разбирается и вычисляется как выражение Python (технически говоря, список условий), используя словари *globals* и *locals* в качестве глобального и локального пространства имён. Если словарь *globals* присутствует и не содержит значения для ключа ``__builtins__``, то перед разбором *выражения* в него вставляется ссылка на словарь встроенного модуля :mod:`builtins`. Таким образом, вы можете контролировать доступные в исполняемом коде встроенные функции, вставив свой собственный словарь ``__builtins__`` в *globals* перед его передачей в функцию :func:`eval`. Если словарь *locals* опущен, то он по умолчанию равен словарю *globals*. Если оба словаря опущены, выражение выполняется с использованием *globals* и *locals* в окружении, где вызывается функция :func:`eval`. Обратите внимание, что *eval()* не имеет доступа к :term:`вложенным областям видимости <nested scope>` (нелокальным переменным) во внешней среде.

source: The return value is the result of the evaluated expression. Syntax errors are reported as exceptions. Example:
ru: Возвращаемое значение - это результат вычисленного выражения. Синтаксические ошибки сообщаются как исключения. Пример:

source: This function can also be used to execute arbitrary code objects (such as those created by :func:`compile`). In this case, pass a code object instead of a string. If the code object has been compiled with ``'exec'`` as the *mode* argument, :func:`eval`\'s return value will be ``None``.
ru: Эта функция также может использоваться для выполнения произвольных объектов кода (таких, как те, которые создаются с помощью :func:`compile`). В этом случае передайте объект кода вместо строки. Если объект кода был скомпилирован с аргументом *mode* равным ``'exec'``, возвращаемое значение :func:`eval` будет ``None``.

source: Hints: dynamic execution of statements is supported by the :func:`exec` function. The :func:`globals` and :func:`locals` functions return the current global and local dictionary, respectively, which may be useful to pass around for use by :func:`eval` or :func:`exec`.
ru: Подсказки: динамическое выполнение инструкций поддерживается функцией :func:`exec`. Функции :func:`globals` и :func:`locals` возвращают текущий глобальный и локальный словари соответственно, которые могут быть полезны для передачи в :func:`eval` или :func:`exec`.

source: If the given source is a string, then leading and trailing spaces and tabs are stripped.
ru: Если заданный источник является строкой, то ведущие и завершающие пробелы и табуляции удаляются.

source: See :func:`ast.literal_eval` for a function that can safely evaluate strings with expressions containing only literals.
ru: См. :func:`ast.literal_eval` для функции, которая может безопасно вычислять строки с выражениями, содержащими только литералы.

source: Raises an :ref:`auditing event <auditing>` ``exec`` with argument ``code_object``.
ru: Возбуждает:ref:`событие аудита <auditing>` ``exec`` с аргументом ``code_object``.

source: Raises an :ref:`auditing event <auditing>` ``exec`` with the code object as the argument. Code compilation events may also be raised.
ru: Возбуждает :ref:`событие аудита <auditing>` ``exec`` с объектом кода в качестве аргумента. Также могут быть возбуждены события компиляции кода.

source: This function supports dynamic execution of Python code. *object* must be either a string or a code object. If it is a string, the string is parsed as a suite of Python statements which is then executed (unless a syntax error occurs). [#]_ If it is a code object, it is simply executed. In all cases, the code that's executed is expected to be valid as file input (see the section :ref:`file-input` in the Reference Manual). Be aware that the :keyword:`nonlocal`, :keyword:`yield`, and :keyword:`return` statements may not be used outside of function definitions even within the context of code passed to the :func:`exec` function. The return value is ``None``.
ru: Эта функция поддерживает динамическое выполнение кода Python. *object* должен быть либо строкой, либо объектом кода. Если это строка, то она разбирается как набор инструкций Pytho, которые затем выполняются (если не возникает синтаксическая ошибка). [#]_ Если это объект кода, он просто выполняется. Во всех случаях ожидается, что выполняемый код будет действительным в качестве входных данных файла (см. раздел :ref:`file-input` в Справочном Руководстве). Имейте в виду, что инструкции :keyword:`nonlocal`, :keyword:`yield` и :keyword:`return` не могут использоваться за пределами определений функций, даже в контексте кода, переданного функции :func:`exec`. Возвращаемое значение - ``None``.

source: In all cases, if the optional parts are omitted, the code is executed in the current scope. If only *globals* is provided, it must be a dictionary (and not a subclass of dictionary), which will be used for both the global and the local variables. If *globals* and *locals* are given, they are used for the global and local variables, respectively. If provided, *locals* can be any mapping object. Remember that at the module level, globals and locals are the same dictionary. If exec gets two separate objects as *globals* and *locals*, the code will be executed as if it were embedded in a class definition.
ru: Во всех случаях, если необязательные части опущены, код выполняется в текущей области видимости. Если предоставлен только *globals*, он должен быть словарем (а не подклассом словаря), который будет использоваться как для глобальных, так и для локальных переменных. Если предоставлены *globals* и *locals*, они используются для глобальных и локальных переменных соответственно. Если предоставлено *locals*, оно может быть любым объектом сопоставления. Помните, что на уровне модуля глобальные и локальные переменные представляют собой один и тот же словарь. Если exec получает два отдельных объекта в качестве *globals* и *locals*, код будет выполняться так, как если бы он был встроен в блок кода класса.

source: If the *globals* dictionary does not contain a value for the key ``__builtins__``, a reference to the dictionary of the built-in module :mod:`builtins` is inserted under that key. That way you can control what builtins are available to the executed code by inserting your own ``__builtins__`` dictionary into *globals* before passing it to :func:`exec`.
ru: Если словарь *globals* не содержит значение для ключа ``__builtins__``, то ссылка на словарь встроенного модуля :mod:`builtins` вставляется под этим ключом. Таким образом, вы можете контролировать, какие встроенные функции доступны для выполнения кода, вставляя свой собственный словарь ``__builtins__`` в *globals* перед его передачей в функцию :func:`exec`.

source: The *closure* argument specifies a closure--a tuple of cellvars. It's only valid when the *object* is a code object containing free variables. The length of the tuple must exactly match the number of free variables referenced by the code object.
ru: Аргумент *closure* указывает на замыкание - кортеж из ячеек. Он действителен только тогда, когда *объект* является объектом кода, содержащим свободные переменные. Длина кортежа должна точно соответствовать количеству свободных переменных, на которые ссылается объект кода.

source: The built-in functions :func:`globals` and :func:`locals` return the current global and local dictionary, respectively, which may be useful to pass around for use as the second and third argument to :func:`exec`.
ru: Встроенные функции :func:`globals` и :func:`locals` возвращают текущий глобальный и локальный словарь соответственно, что может быть полезно для передачи в качестве второго и третьего аргумента в :func:`exec`.

source: The default *locals* act as described for function :func:`locals` below: modifications to the default *locals* dictionary should not be attempted. Pass an explicit *locals* dictionary if you need to see effects of the code on *locals* after function :func:`exec` returns.
ru: *locals* по умолчанию действуют так, как описано для функции :func:`locals` ниже: изменения в словаре по умолчанию *locals* не должны предприниматься. Передайте явный словарь *locals*, если вам нужно увидеть эффекты кода на *locals* после возврата функции :func:`exec`.

source: Added the *closure* parameter.
ru: Добавлен параметр *closure*.

source: Construct an iterator from those elements of *iterable* for which *function* is true. *iterable* may be either a sequence, a container which supports iteration, or an iterator. If *function* is ``None``, the identity function is assumed, that is, all elements of *iterable* that are false are removed.
ru: Создаёт итератор из тех элементов *iterable*, для которых *function* истинно. *iterable* может быть последовательностью, контейнером, поддерживающим итерацию, или итератором. Если *function* равно ``None``, предполагается функция идентичности, то есть все элементы *iterable*, которые являются ложными, удаляются.

source: Note that ``filter(function, iterable)`` is equivalent to the generator expression ``(item for item in iterable if function(item))`` if function is not ``None`` and ``(item for item in iterable if item)`` if function is ``None``.
ru: Обратите внимание, что ``filter(function, iterable)`` эквивалентно генераторному выражению ``(item for item in iterable if function(item))``, если функция не равна ``None``, и ``(item for item in iterable if item)``, если функция равна ``None``.

source: See :func:`itertools.filterfalse` for the complementary function that returns elements of *iterable* for which *function* is false.
ru: См. :func:`itertools.filterfalse` для дополнительной функции, которая возвращает элементы *iterable*, для которых *function* является ложным.

source: Return a floating point number constructed from a number or string *x*.
ru: Возвращает число с плавающей точкой, построенное из числа или строки *x*.

source: If the argument is a string, it should contain a decimal number, optionally preceded by a sign, and optionally embedded in whitespace. The optional sign may be ``'+'`` or ``'-'``; a ``'+'`` sign has no effect on the value produced. The argument may also be a string representing a NaN (not-a-number), or positive or negative infinity. More precisely, the input must conform to the ``floatvalue`` production rule in the following grammar, after leading and trailing whitespace characters are removed:
ru: Если аргумент является строкой, она должна содержать десятичное число, необязательно с предшествующим знаком и необязательно заключенное в пробел. Необязательный знак может быть ``'+'`` или ``'-'``; знак ``'+'`` не влияет на полученное значение. Аргумент также может быть строкой, представляющей NaN (не число) или положительную или отрицательную бесконечность. Более точно, входные данные должны соответствовать правилу вывода ``floatvalue`` в следующей грамматике после удаления ведущих и завершающих пробельных символов:

source: Case is not significant, so, for example, "inf", "Inf", "INFINITY", and "iNfINity" are all acceptable spellings for positive infinity.
ru: Регистр не имеет значения, поэтому, например, "inf", "Inf", "INFINITY" и "iNfINity" - все допустимые написания для положительной бесконечности.

source: Otherwise, if the argument is an integer or a floating point number, a floating point number with the same value (within Python's floating point precision) is returned. If the argument is outside the range of a Python float, an :exc:`OverflowError` will be raised.
ru: В противном случае, если аргумент является целым числом или числом с плавающей запятой, будет возвращено число с плавающей запятой с тем же значением (с точностью чисел с плавающей запятой в Python). Если аргумент находится вне диапазона чисел с плавающей запятой в Python, будет возбуждено исключение :exc:`OverflowError`.

source: For a general Python object ``x``, ``float(x)`` delegates to ``x.__float__()``. If :meth:`~object.__float__` is not defined then it falls back to :meth:`~object.__index__`.
ru: Для обобщённого объекта Python ``x``, ``float(x)`` делегирует вызов метода ``x.__float__()``. Если :meth:`~object.__float__` не определён, то вызывается :meth:`~object.__index__`.

source: If no argument is given, ``0.0`` is returned.
ru: Если аргументы не заданы, возвращает ``0.0``.

source: Examples::
ru: Примеры::

source: The float type is described in :ref:`typesnumeric`.
ru: Тип float описан в :ref:`typesnumeric`.

source: Falls back to :meth:`~object.__index__` if :meth:`~object.__float__` is not defined.
ru: Возвращается к :meth:`~object.__index__`, если :meth:`~object.__float__` не определен.

source: Convert a *value* to a "formatted" representation, as controlled by *format_spec*. The interpretation of *format_spec* will depend on the type of the *value* argument; however, there is a standard formatting syntax that is used by most built-in types: :ref:`formatspec`.
ru: Преобразовывает *значение* в "отформатированное" представление, управляемое *format_spec*. Интерпретация *format_spec* будет зависеть от типа аргумента *значение*; однако существует стандартный синтаксис форматирования, который используется большинством встроенных типов: :ref:`formatspec`.

source: The default *format_spec* is an empty string which usually gives the same effect as calling :func:`str(value) <str>`.
ru: Стандартное значение *format_spec* - пустая строка, которая обычно дает тот же эффект, что и вызов :func:`str(value) <str>`.

source: A call to ``format(value, format_spec)`` is translated to ``type(value).__format__(value, format_spec)`` which bypasses the instance dictionary when searching for the value's :meth:`~object.__format__` method. A :exc:`TypeError` exception is raised if the method search reaches :mod:`object` and the *format_spec* is non-empty, or if either the *format_spec* or the return value are not strings.
ru: Вызов ``format(value, format_spec)`` преобразуется в ``type(value).__format__(value, format_spec)``, который обходит словарь экземпляра при поиске метода :meth:`~object.__format__` значения. Возникает исключение :exc:`TypeError`, если поиск метода достигает :mod:`object` и *format_spec* не является пустым, или если *format_spec* или возвращаемое значение не являются строками.

source: ``object().__format__(format_spec)`` raises :exc:`TypeError` if *format_spec* is not an empty string.
ru: ``object().__format__(format_spec)`` вызывает исключение :exc:`TypeError`, если *format_spec* не является пустой строкой.
